[
    {
        "title": "100% Perfect Girl",
        "infoURL": "https://www.mangaupdates.com/series.html?id=6633",
        "description": "Jay Jin is the headstrong teenage rebel, determined to prove she's serious about making art. J. Max is the tall debonair foreigner, in Korea on business, with more--much more--to his background than he lets on. On the surface, it would seem as though Jay and J. have nothing in common... until a chance encounter in a hotel lobby sparks a mysterious attraction. Will true love prove strong enough to overcome the language barrier, not to mention the thousands of miles separating two attractive people? Then there are the interventions of friends and family who think they know best... as well as a disastrous encounter with spicy chicken kebab!\n\nOriginal Webtoon:\nLezhin eComiX \n\nOfficial Translation:\nEnglish: Netcomics Lezhin, BiliBili\nOthers: Indonesian\n\n",
        "year": "2006",
        "authors": [
            "Wann"
        ],
        "tags": [
            "Action",
            "Drama",
            "Mature",
            "Romance",
            "Shoujo",
            "Smut",
            "Male Yandere",
            "Straight"
        ],
        "id": "9e32a1a8"
    },
    {
        "title": "21 Nichigo ni Share House shiteiru Senpai to Fuufu ni natte shimau Monogatari",
        "infoURL": "https://mangadex.org/title/48975dc6-678b-449b-a283-b60dba33a4e5",
        "description": "",
        "year": "",
        "authors": [
            "Tetto"
        ],
        "tags": [
            "Web Comic",
            "Female Yandere",
            "Straight"
        ],
        "id": "4e786d6c"
    },
    {
        "title": "A Monster in Cat's Clothing",
        "infoURL": "https://mangadex.org/title/16cbc4ea-81cd-49f8-b25d-69ec014b195d/",
        "description": "",
        "year": "2020",
        "authors": [
            "Chazuu"
        ],
        "tags": [
            "Thriller",
            "Demons",
            "Animals",
            "Web Comic",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "c7685bf8"
    },
    {
        "title": "A Short Yandere Manga",
        "infoURL": "https://mangadex.org/title/b486153b-9c14-45c5-ac6e-6c17b87d8b9c",
        "description": "",
        "year": "",
        "authors": [
            "Roadrunner"
        ],
        "tags": [
            "Oneshot",
            "Psychological",
            "Tragedy",
            "Female Yandere",
            "Straight"
        ],
        "id": "df2abba8"
    },
    {
        "title": "A Story About Wanting To Commit Suicide, But It's Scary So I Find A Yandere Girl To Kill Me, But It Doesn't Work",
        "infoURL": "https://www.mangaupdates.com/series.html?id=156974",
        "description": "A story about wanting to commit suicide, but it's scary so I find a yandere girl to kill me. But it doesn't work.\n",
        "year": "2019",
        "authors": [
            "Kamis"
        ],
        "tags": [
            "Comedy",
            "Romance",
            "Female Yandere",
            "Straight"
        ],
        "id": "f538a678"
    },
    {
        "title": "A Story About Wanting to Commit Suicide, but It's Scary so I Find a Yandere Girl to Kill Me, but After 100 days, I Somehow Got ○○",
        "infoURL": "https://www.mangaupdates.com/series.html?id=174835",
        "description": "An \"after 100 days\" side story to the original \"A Story About Wanting to Commit Suicide, but It's Scary So I Find a Yandere Girl to Kill Me, but It Doesn't Work\".\n",
        "year": "",
        "authors": [
            "Kamis"
        ],
        "tags": [
            "Comedy",
            "Romance",
            "Female Yandere",
            "Straight"
        ],
        "id": "3c0274de"
    },
    {
        "title": "Abnormal-kei Joshi",
        "infoURL": "https://www.mangaupdates.com/series.html?id=78305",
        "description": "High schooler Shiina Shinya thinks that all girls are pretty much good-for-nothing, mostly because he doesn't understand them at all. That doesn't stop him from being surrounded by strange girls! Tsubasa Tooka, a cute, much-admired girl, stalks him. Shikimura Masami is majorly into masochism, and has recruited Shinya into her play sessions. Ikari Satsuki seems suspiciously interested in the recent serial stabbings, and seems to want to drag Shinya into it. Banjou Yoruko, a normally quiet, bookish girl, has decided she and Shinya are bound up in some fantasy setting. Uchida Yumeji is the school's sleeping beauty, who spends all of her time in the infirmary because she requires so much sleep. Shinya brings her newspapers, so she can keep up with current events in the short time she spends awake. Lastly, Okui Akane is convinced she is a vampire. For all Shinya knows, it could be true, but in practice it just means that he has to let her drink his blood. How will Shinya deal with all these good-for-nothing girls that complicate his life?\n\n",
        "year": "2012",
        "authors": [
            "SANADA Eleven"
        ],
        "tags": [
            "Drama",
            "Harem",
            "Horror",
            "Mature",
            "Psychological",
            "School Life",
            "Seinen",
            "Female Yandere",
            "Straight",
            "Incest"
        ],
        "id": "9ec3ca7d"
    },
    {
        "title": "Acute",
        "infoURL": "https://www.mangaupdates.com/series.html?id=105967",
        "description": "Based on Kurousa-P's popular Vocaloid song Acute, Miku and Luka are childhood friends with an interest in the same boy. While they know it’s best for all of them to just stay friends, what will happen if one of them can’t keep their promise…?\n",
        "year": "2013",
        "authors": [
            "Kurousa-P",
            "ASAHINA Shiori"
        ],
        "tags": [
            "Drama",
            "Romance",
            "Shoujo",
            "Tragedy",
            "Female Yandere",
            "Straight"
        ],
        "id": "90422a05"
    },
    {
        "title": "Aisareru yori ￮ Saretai",
        "infoURL": "https://www.mangaupdates.com/series.html?id=144029",
        "description": "Every day, Asahide goes to school depressed. This changes one day when he meets a girl on the rooftop. But there seems to be more to this mysterious girl than she lets on...\n",
        "year": "2017",
        "authors": [
            "YUUKI Akira"
        ],
        "tags": [
            "Drama",
            "Horror",
            "Romance",
            "School Life",
            "Shounen",
            "Female Yandere",
            "Straight"
        ],
        "id": "07840e0c"
    },
    {
        "title": "Aishite Kudasai, Sensei",
        "infoURL": "https://www.mangaupdates.com/series.html?id=48245",
        "description": "From Midnight Scans:\n\nKitou Hijiri, a student, confessed his feelings to a Chemistry teacher named Nakatani Ayano whom he had fallen in love with 8 years ago. Somehow when he was young, he lived beside Ayano and bear feelings for her. Ayano, in turn, could not resist Hijiri’s determination and strong feelings towards her. What will be the ending of their taboo love?\n",
        "year": "2009",
        "authors": [
            "KURUMATANI Haruko"
        ],
        "tags": [
            "Drama",
            "Mature",
            "Romance",
            "School Life",
            "Shoujo",
            "Male Yandere",
            "Straight"
        ],
        "id": "a194ef70"
    },
    {
        "title": "Akarui Sekai Keikaku",
        "infoURL": "https://www.mangaupdates.com/series.html?id=86800",
        "description": "The minister's aide has an idea, a project in mind to help correct the declining birth rates in Japan. This plan, so to speak, has it where Japan's youth are encouraged to form relationships. The catch is that at the chosen high school for the initial test of this is being held, the project is mandatory - the students must become intimate couples with the other students or they will die.\n",
        "year": "2012",
        "authors": [
            "AOKI Aki",
            "IZUMI Kouki"
        ],
        "tags": [
            "Comedy",
            "Drama",
            "Ecchi",
            "Harem",
            "Romance",
            "School Life",
            "Shounen",
            "Female Yandere",
            "Straight"
        ],
        "id": "ce55bdd4"
    },
    {
        "title": "Aku no Hana",
        "infoURL": "https://www.mangaupdates.com/series.html?id=47462",
        "description": "From Vertical:\nThe story opens as middle school student Takao Kasuga receives an F on a math test. But he doesn't even seem to notice because he's too engrossed in surreptitiously reading Beaudelaire's The Flowers of Evil. And the day goes downhill from there. In a moment of weakness, he finds and takes home the gym clothes belonging to sweet, pretty Nanako Saeki on whom he has a major crush. Unfortunately for Takao, there's a witness to the theft: Nakamura, who has a huge chip on her shoulder and a sadistic streak.\n\nAs the saga unfolds, we see Takao struggling to decide whether to confess or cover up his misdeeds at the same time that he tries to win over the girl of his dreams, and avoid the blackmail attempts of Nakamura, his new ”BFF.”\n\nOfficial English:\nAzuki, INKR\n\n",
        "year": "2009",
        "authors": [
            "OSHIMI Shuzo"
        ],
        "tags": [
            "Drama",
            "Mature",
            "Psychological",
            "Romance",
            "School Life",
            "Shounen",
            "Slice of Life",
            "Female Yandere",
            "Straight"
        ],
        "id": "90a3088c"
    },
    {
        "title": "Akuyaku Reijou no Shitsuji-sama: Hametsu Flag wa Ore ga Tsubusasete itadakimasu",
        "infoURL": "https://www.mangaupdates.com/series.html?id=172105",
        "description": "A reincarnation story with a twist! I, Cyril, have been reborn in a new world and pledged myself to save Lady Sophia, the villainess of an otome game, from the many horrible fates that await her! I've raised her to be a proper young lady, keeping her from turning to the dark side... but apparently, she's developed feelings for me. And now the game's heroine has appeared, putting all I've accomplished at risk. Still, as her all-knowing butler, I will defy fate and ensure milady's happiness!\n\nOriginal Web Novel: Kakuyomu, Syosetu\n\nOriginal Web Publication\n\nOfficial English Translation\n\n",
        "year": "2020",
        "authors": [
            "HIIRONO Ame",
            "Shoubu"
        ],
        "tags": [
            "Fantasy",
            "Romance",
            "Seinen",
            "Slice of Life",
            "Female Yandere",
            "Straight"
        ],
        "id": "242010ba"
    },
    {
        "title": "Akuyaku Reijou to Kichiku Kishi",
        "infoURL": "https://www.mangaupdates.com/series/rcs1fuw/akuyaku-reijou-to-kichiku-kishi",
        "description": "From Painful Nightz:\n\nThe Marquis' daughter, Cecilia, had suddenly realised the fact that she had reincarnated into an Otome game as the villainous daughter! However, it was already too late for her to avoid condemnation. After breaking off her marriage engagement, she was framed by the heroine and had fallen, forcing her to become a prostitute. Her first customer was the heroine’s childhood friend, the Deputy Leader of the Imperial Guards, Lucas Herbst, who was so strong that he could even be considered a cheater in life. Frightened, Cecilia was embraced relentlessly only to awake in the residence of the Duke of Herbst the next morning. Moreover, a mark of the vow was engraved on her lower abdomen, marking her as Lucas’s fiancéeー?!\n\nOriginal Web Publication\n\n",
        "year": "2021",
        "authors": [
            "Nekoda",
            "Seikan"
        ],
        "tags": [
            "Fantasy",
            "Romance",
            "Shoujo",
            "Smut",
            "Male Yandere",
            "Straight",
            "NSFW"
        ],
        "id": "fd0e0496"
    },
    {
        "title": "Akuyaku Reijou no Tsuihougo!: Kyoukai Kaikaku Gohan de Yuuyuu Sister-gurashi",
        "infoURL": "https://www.mangaupdates.com/series.html?id=152938",
        "description": "Event planner Yuka Sawatani‘s life ended as the result of overwork. Reborn into an Otome game with her memory intact, she becomes the villainess Elizabeth. She tries to resist her fate, but at the ending of the game, she is promptly banished and becomes a nun at a church.\n",
        "year": "2019",
        "authors": [
            "YUZUHARA Teiru",
            "YOSHIMURA Tsumuji"
        ],
        "tags": [
            "Adventure",
            "Comedy",
            "Fantasy",
            "Romance",
            "Shoujo",
            "Slice of Life",
            "Male Yandere",
            "Straight"
        ],
        "id": "bebb0ad4"
    },
    {
        "title": "Ana Satsujin",
        "infoURL": "https://www.mangaupdates.com/series.html?id=106086",
        "description": "Who do you think lives next door? A college student? A secretary? A foodie? A quiet sort? Or a killer?\n",
        "year": "2013",
        "authors": [
            "Rahson"
        ],
        "tags": [
            "Comedy",
            "Drama",
            "Ecchi",
            "Horror",
            "Mature",
            "Romance",
            "Shounen",
            "Female Yandere",
            "Straight"
        ],
        "id": "a51a4994"
    },
    {
        "title": "Ane ga Kensei de Imouto ga Kenja de",
        "infoURL": "https://www.mangaupdates.com/series/izrgb0f/",
        "description": "The Ralk Kingdom is a country of extreme meritocracy, but a femboy Razel, the son of the stupid king, has no talent for martial arts, and because he is always compared to his older sister who is a sword saint and his younger sister who is a sage, he gets banished from the kingdom. Afterwards, he tries to live as an adventurer in a different country, but his older and younger sisters, who love him dearly, come after him!? A lovey-dovey life of an adventurer with strong and slightly lewd sisters begins!\n",
        "year": "2020",
        "authors": [
            "Senkianten",
            "SORA Mochi"
        ],
        "tags": [
            "Adventure",
            "Comedy",
            "Ecchi",
            "Fantasy",
            "Harem",
            "Shounen",
            "Female Yandere",
            "Straight",
            "Incest"
        ],
        "id": "e6d876a2"
    },
    {
        "title": "Ane Naru Mono",
        "infoURL": "https://www.mangaupdates.com/series.html?id=130755",
        "description": "When an orphan encounters the eldritch demon Shub-Niggurath, the \"Black Goat of the Woods with a Thousand Young\" offers him one wish. His request: \"Become my big sister.\"\n",
        "year": "2016",
        "authors": [
            "IIDA Pochi."
        ],
        "tags": [
            "Comedy",
            "Ecchi",
            "Romance",
            "Seinen",
            "Slice of Life",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "8881e33e"
    },
    {
        "title": "Ani to Imouto no Shitai Shitai Shitai Koto",
        "infoURL": "https://www.mangaupdates.com/series/9qblfex/",
        "description": "Moriyama Kouta was once an unsuccessful adult manga artist. Due to a lack of popularity, he was even on the verge of going out of business. But one day he became a very popular author with vividly realistic and charming portrayals of his heroines. The reason for the sudden change in style was that Kouta has taken his younger sister Shizuku as his model?\n",
        "year": "2021",
        "authors": [
            "HANO Haruka"
        ],
        "tags": [
            "Adult",
            "Drama",
            "Psychological",
            "Romance",
            "Shounen",
            "Slice of Life",
            "Female Yandere",
            "Straight",
            "Incest"
        ],
        "id": "65228288"
    },
    {
        "title": "AntiSTALKER",
        "infoURL": "https://www.webtoons.com/en/romance/antistalker/list?title_no=2087",
        "description": "At this school usual students study with vampires from wealthy families. She is a representative from disciplinary committee, he is a guy who breaks school rules. She is a hunter, he is a target. He is her stalker, she is his target.",
        "year": "2020",
        "authors": ["VOKIVORMOK"],
        "tags": [
            "Web Comic",
            "Male Yandere",
            "Straight"
        ],
        "id": "04cbb0fc"
    },
    {
        "title": "Appetite",
        "infoURL": "https://www.mangaupdates.com/series.html?id=141847",
        "description": "Dohoon can’t find a reason to live. He hoped to get a fresh start at his new high school, but things are no different—the bullies make fun of his limp and no one wants to be his friend. Then one night, he runs into a classmate, Aji... Having seen something he shouldn’t, the two make a deal: Aji will protect him for the time being, but when he turns 20, Dohoon will have to pay up.\n\nOriginal Webtoon:\nLezhin (Expired), Kakao\n\nOfficial Translation:\nEnglish, Japanese\n",
        "year": "2015",
        "authors": [
            "Lero"
        ],
        "tags": [
            "Action",
            "Horror",
            "Romance",
            "School Life",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "6e00831d"
    },
    {
        "title": "Arisa",
        "infoURL": "https://www.mangaupdates.com/series.html?id=35505",
        "description": "For years the rash tomboyish Tsubasa had communicated with her twin through letters. She had formed the idea that the gentle Arisa led a joyful school life. But upon Arisa's sudden suicide attempt, Tsubasa vows to find the reason behind her twin's actions by taking her place at school. But will this supposed joyful life be too much for Tsubasa to handle? What does it have to do with the people disappearing from Arisa's school...\n\nNote: Extras in volume 6 and 7 have not been scanlated.\n\nOfficial English: INKR\nOfficial English Translation\n",
        "year": "2009",
        "authors": [
            "ANDOU Natsumi"
        ],
        "tags": [
            "Drama",
            "Mystery",
            "Psychological",
            "School Life",
            "Shoujo",
            "Male Yandere",
            "Straight"
        ],
        "id": "5eff5430"
    },
    {
        "title": "Asper Kanojo",
        "infoURL": "https://www.mangaupdates.com/series.html?id=149321",
        "description": "Yokoi Taku has trouble getting along with people, so he moved to Tokyo as soon as he graduated from high school. He now lives alone, making a living by delivering newspapers and drawing doujinshi, though people totally ignore his non-erotic works. One day, a girl named Saitou Megumi suddenly shows up at his door, claiming that she came all the way from Tottori to meet him because she's a big fan of one of his doujinshi. It ends up that she has faced many hardships herself, and with no intention of leaving, she ends up living with him.\n",
        "year": "2018",
        "authors": [
            "HAGIMOTO Souhachi",
            "MORITA Renji"
        ],
        "tags": [
            "Drama",
            "Psychological",
            "Romance",
            "Seinen",
            "Slice of Life",
            "Female Yandere",
            "Straight"
        ],
        "id": "fbd99e21"
    },
    {
        "title": "At That Time, The Battle Began",
        "infoURL": "https://www.mangaupdates.com/series.html?id=180837",
        "description": "About a guy whose love interests are all kinds of messed up yanderes.\n",
        "year": "2021",
        "authors": [
            "TALI"
        ],
        "tags": [
            "Comedy",
            "Harem",
            "Romance",
            "Shounen",
            "Female Yandere",
            "Straight"
        ],
        "id": "1159474c"
    },
    {
        "title": "August 9th, I Will Be Eaten by You",
        "infoURL": "https://www.mangaupdates.com/series.html?id=170696",
        "description": "In order to eat me, my enigmatic stalker is protecting me from other strange women― A high school boy, Sakurai Aoi, has a secret he cannot tell anyone: he has been plagued by stalkers since he was a child. One day, his classmate, Ueda, suddenly transforms into a monster, revealed to be one of his stalkers. Miyako, who has always been closely following him, appears and saves him. She tells Sakurai that the monsters, commonly known as urban legends in Japan, are after him because they love him. What will be the fate of Sakurai who is loved by countless creatures disguised as beautiful girls?\n",
        "year": "2020",
        "authors": [
            "tomomi"
        ],
        "tags": [
            "Drama",
            "Harem",
            "Horror",
            "Mystery",
            "Psychological",
            "Romance",
            "Seinen",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "741d3860"
    },
    {
        "title": "Black Kanojo",
        "infoURL": "https://www.mangaupdates.com/series.html?id=126631",
        "description": "Hoshino Teru, a mediocre middle school boy has a crush on Amamiya, his childhood friend. However, \"Micchan\" stands between them, and brings chaos upon Teru's life.\n",
        "year": "2015",
        "authors": [
            "YOSHIHARA Masahiko"
        ],
        "tags": [
            "Comedy",
            "Drama",
            "Ecchi",
            "Harem",
            "Horror",
            "Mature",
            "Romance",
            "School Life",
            "Seinen",
            "Female Yandere",
            "Straight"
        ],
        "id": "2465dc77"
    },
    {
        "title": "Bouken ni, Tsuitekonai de Okaa-san! - Chouka Hogo na Saikyou Dragon ni Sodaterareta Musuko, Hahaoya Douhan de Boukensha ni Naru",
        "infoURL": "https://www.mangaupdates.com/series.html?id=154199",
        "description": "Ryuuji who was an orphan was picked up and raised by the world's strongest evil dragon. When he turned 15, he had intended to leave the house and be independent, but his mother proclaims that to do so he must defeat her. \"You're lvl 999! How the hell am I supposed to do that?!\" \n\nSomehow, he manages to persuade her and he is allowed to journey out, however, she ends up joining him as his companion. \n\n\"You wish to join my son's party? Then you'll have to pass the interview with me.\"\n\"An extermination quest? It's dangerous, so let your mother handle this.\"\n\"Dungeon exploration? I've already cleaned up the small fry there.\"\n\nDue to the overprotective mother by his side, suffering and misfortune continue to pour. Will he be able to stand on his own as an adventurer and as a man?\n\n",
        "year": "2019",
        "authors": [
            "Ibarakino",
            "Shishimaruzilla"
        ],
        "tags": [
            "Action",
            "Adventure",
            "Comedy",
            "Ecchi",
            "Fantasy",
            "Romance",
            "Shounen",
            "Female Yandere",
            "Straight",
            "Incest"
        ],
        "id": "dd140df2"
    },
    {
        "title": "Boku no Kanojo wa Kirei ni Warau",
        "infoURL": "https://www.mangaupdates.com/series.html?id=154676",
        "description": "\"Kii-kun will never learn!!\" The childhood friend Tsubaki has a little secret she's been keeping. But stray too close and she'll say back, \"it's fine, it's fine... I'll be fine...\".\n",
        "year": "2018",
        "authors": [
            "NAKAYAMA Chibako"
        ],
        "tags": [
            "Comedy",
            "Drama",
            "Psychological",
            "Romance",
            "School Life",
            "Shounen",
            "Female Yandere",
            "Straight"
        ],
        "id": "778b59a7"
    },
    {
        "title": "Boku to Kanojo no Tenseiru Isekai",
        "infoURL": "https://www.mangaupdates.com/series.html?id=163146",
        "description": "Takayoshi an otaku was murdered by a female stalker named Kurona who killed each other through impact by the truck she stole.There he ends up reincarnated in a fantasy world where he is living his isekai fantasy as a hero and adored by harem girls but unfortunately ,his stalker Kurona after getting killed by the impact from the truck she stole also ends up in the fantasy world and takes on the form on one of the female girls killed him.\n\nNow reincarnated in the another fantasy world by the goddess he encountered,Takayoshi must be careful on which female he could trust as Kurona still follows him and takes on one of the female girls he encountered to strike at him at any moment\n\n",
        "year": "2020",
        "authors": [
            "Kojii"
        ],
        "tags": [
            "Comedy",
            "Drama",
            "Fantasy",
            "Harem",
            "Romance",
            "Seinen",
            "Slice of Life",
            "Female Yandere",
            "Straight",
            "Raw"
        ],
        "id": "537a7d37"
    },
    {
        "title": "Boku wa Kimitachi wo Shihai suru",
        "infoURL": "https://www.mangaupdates.com/series/trw8dku/",
        "description": "From Kodansha:\nDuring a class reunion, the school became an enclosed dimension without warning. Yelling and screaming brought no response. 26-year-old unemployed Haruka Sato has to survive by cooperating with seven of his former classmates. Soon, the extreme conditions began to eat away at their sanity, and Haruka's hidden desires began to take hold.\n",
        "year": "2022",
        "authors": [
            "CHIDA Daisuke"
        ],
        "tags": [
            "Adult",
            "Drama",
            "Harem",
            "Romance",
            "School Life",
            "Seinen",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "600fdb1a"
    },
    {
        "title": "Chi no Wadachi",
        "infoURL": "https://www.mangaupdates.com/series.html?id=139463",
        "description": "Seiichi Osabe is just a normal if not insular 14-year-old boy with a beautiful, loving mother and a hardworking father. The bond between him and his mother is iron-clad, but when an accident involving his cousin sows the seeds of doubt in his head, Seiichi begins to question whether his mother's doting nature is normal, or something more sinister and abnormal. Where do you draw the line between motherly love and unhealthy adoration? And how can you tell where that line is when your mother's love is all you've ever known?\n\n(Source: Anime-Planet)\n",
        "year": "2017",
        "authors": [
            "OSHIMI Shuzo"
        ],
        "tags": [
            "Drama",
            "Psychological",
            "School Life",
            "Seinen",
            "Slice of Life",
            "Female Yandere",
            "Straight",
            "Incest"
        ],
        "id": "3d262a92"
    },
    {
        "title": "Cherry Boy, That Girl",
        "infoURL": "https://www.mangaupdates.com/series.html?id=104380",
        "description": "From Easy Going Scans\n\nWhat happens when you take a good, long look and realize that your boyfriend is prettier that you? And what happens when you go to a high school with so few girls that you're considered a goddess? But then again, your pretty boyfriend is also attending the same school...\n\nOriginal webtoon\n",
        "year": "2012",
        "authors": [
            "South Ant",
            "U Yeon Hui",
            "Li Geum San"
        ],
        "tags": [
            "Comedy",
            "Drama",
            "Gender Bender",
            "Romance",
            "School Life",
            "Shoujo",
            "Male Yandere",
            "Straight"
        ],
        "id": "80f42b8c"
    },
    {
        "title": "Chotto dake ai ga omoi Dark Elf ga isekai kara oikakete kita",
        "infoURL": "https://www.mangaupdates.com/series/kfaxu1w/",
        "description": "Serialization of the H-Doujin by the same name, as a non-H work.\n\nHinata is a high school student who reincarnated into a different world and became a hero by the power of God. He defeated the Demon King with the help of the dark elf Mariabelle and other friends. Thus he safely fulfilled the wishes of God and returned to this world. One month after Hinata returned to this world, for some reason Mariabelle also came here from the other world !! The reason she came here is to be with her beloved Hinata. With heavy love and a teaspoon of jealousy, she attacked Hinata every time he refused. Will Hinata, who has decided to live with Maribelle, be able to live safely? A sweet and thick romantic comedy woven around the dark elf beauty's slightly heavy schizophrenic love.\n\n",
        "year": "2021",
        "authors": [
            "Nakano Sora"
        ],
        "tags": [
            "Adult",
            "Comedy",
            "Ecchi",
            "Fantasy",
            "Romance",
            "Seinen",
            "Slice of Life",
            "Female Yandere",
            "Straight"
        ],
        "id": "2550b4e0"
    },
    {
        "title": "Cock Robin wo Korosu no wa",
        "infoURL": "https://www.mangaupdates.com/series.html?id=41915",
        "description": "One day, when Hidaka Kishi is going to school with his close friend Kimiko, he notices a strange new song on his music player: \"Who Killed Cock Robin?\" Little does he know, a murderous game is beginning, with him as the target--the Cock Robin. Fourteen other players (called 'birds') are all competing to kill him, in exchange for making their wishes come true. However, one of the birds, Saedano Minami, seems to have other plans. To Hidaka's confusion, she decides to protect him, but what is her ultimate goal? How will Hidaka survive this deadly game?\n",
        "year": "2009",
        "authors": [
            "Youryuu"
        ],
        "tags": [
            "Drama",
            "Mystery",
            "Shounen",
            "Female Yandere",
            "Straight"
        ],
        "id": "b048e267"
    },
    {
        "title": "Criminale!",
        "infoURL": "https://www.mangaupdates.com/series.html?id=120707",
        "description": "Our protagonist, Ichimura Tamito, is a criminal magnet. Ever since he could remember he had attracted criminals from kidnappers kidnapping him when he was just a newborn, to robbers stealing his toys. He is determined to start a new life and make new friends after moving into a new city but at the start of the day he was bombarded by all sorts of crime. After encountering a knife wielding killer in broad daylight he saves a young girl that coincidentally belongs to the same class as he does. But something seems off about this girl and his new class too. It seems like our protagonist's magnetic pull on crime and criminals is getting stronger as he find out that he belongs to a class of criminals and suspects.\n\nOriginal Web Manga\n\n",
        "year": "2015",
        "authors": [
            "MIZUIRO Suimin"
        ],
        "tags": [
            "Action",
            "Adventure",
            "Comedy",
            "Ecchi",
            "Harem",
            "Romance",
            "School Life",
            "Shounen",
            "Female Yandere",
            "Straight"
        ],
        "id": "43b8ff83"
    },
    {
        "title": "Cross Days",
        "infoURL": "https://www.mangaupdates.com/series.html?id=52865",
        "description": "Yuuki Ashikaga is a high-school freshman at Sakakino Academy.  While working as a student librarian, he grows enamored of Kotonoha Katsura, a girl who frequents the library. Unfortunately, Kotonoha is already dating Makoto Itou, another schoolmate.  \n\nThe situation is further complicated when Chie, Yuuki's older sister introduces him to Roka Kitsuregawa, her kouhai in the basketball club.  Roka becomes interested in Yuuki, who only has eyes for Kotonoha.  In order to make him jealous, Roka lies and claims she already has a boyfriend, her former classmate Makoto Itou.  Unfortunately for all of them, Roka's lie sets off a chain of events no one could have predicted...\n\nNote: Cross Days takes place in the middle of the original School Days storyline and provides an alternate take on how things might have turned out.\n\n",
        "year": "2010",
        "authors": [
            "Overflow",
            "SAKAZUKI Homare"
        ],
        "tags": [
            "Comedy",
            "Gender Bender",
            "Harem",
            "Romance",
            "School Life",
            "Shounen",
            "Shounen Ai",
            "Female Yandere",
            "Straight"
        ],
        "id": "01f0196b"
    },
    {
        "title": "Cupid’s Chocolates",
        "infoURL": "https://www.mangaupdates.com/series.html?id=128486",
        "description": "From Overworld Scans:\nJiang Hao Yi, a normal, high-school student who is extremely scared of getting into trouble suddenly becomes the Harem King of his school and gets confessed to by a bunch of beautiful girls!.\nThe worst thing is, Jiang hao doesn't know any of the girls who confessed to him. What on earth is happening?\n\nLinks:\nOriginal WebComic (Raw)\n",
        "year": "2015",
        "authors": [
            "VivianTianZong"
        ],
        "tags": [
            "Comedy",
            "Ecchi",
            "Harem",
            "Romance",
            "School Life",
            "Female Yandere",
            "Straight"
        ],
        "id": "8b2d4022"
    },
    {
        "title": "Cute and Loveable Girl Doesn't Deserve to be Treated Poorly",
        "infoURL": "https://mangadex.org/title/bcbf2a60-761f-4f36-9eaa-44456e6ab146/",
        "description": "She's lovable and cute, and she shouldn't be treated poorly.",
        "year": "2022",
        "authors": [
            "三稜 釜次郎 (Kamazirou)"
        ],
        "tags": [
            "Psychological",
            "Romance",
            "Drama",
            "Web Comic",
            "Female Yandere",
            "Straight",
            "Harem"
        ],
        "id": "49625750"
    },
    {
        "title": "Cyclops Shoujo Saipu",
        "infoURL": "https://www.mangaupdates.com/series.html?id=64680",
        "description": "When Fuuka hit her second year of middle school, puberty kicked in. Now she's really tall and has huge boobs. Due to her hairstyle, her classmates call her \"Saipu,\" after the cyclops. Her affection for her older brother was cute when she was a little girl and said she wanted to marry him. Now it just freaks him out, since she's decided she's adult enough to follow through on her childish promises. This 4-koma style manga is the story of the life of this cyclops girl!\n",
        "year": "2011",
        "authors": [
            "TORA Yasu"
        ],
        "tags": [
            "Comedy",
            "Ecchi",
            "Romance",
            "School Life",
            "Seinen",
            "Female Yandere",
            "Straight",
            "Incest"
        ],
        "id": "b5469b2e"
    },
    {
        "title": "Dancin’ Respawn",
        "infoURL": "https://www.mangaupdates.com/series.html?id=169578",
        "description": "Like an RPG character, Dannoura Choushi possesses a constitution that allows him to respawn at the last place he slept whenever he dies. When he saves Yamazaki An's life, she falls madly in love with him. Will he able to respond to her heavy love? The curtain opens on a sinister, yandere comedy.\n",
        "year": "2019",
        "authors": [
            "Mikashima Kentaro"
        ],
        "tags": [
            "Comedy",
            "Fantasy",
            "Romance",
            "Seinen",
            "Slice of Life",
            "Female Yandere",
            "Straight"
        ],
        "id": "ce8b2395"
    },
    {
        "title": "Dark Gathering",
        "infoURL": "https://www.mangaupdates.com/series.html?id=154022",
        "description": "Keitarou, who's always had a disposition for attracting spirits, gets hired as a tutor for a little girl named Yayoi who can see spirits and is searching for the spirit that took away her mother.\n",
        "year": "2019",
        "authors": [
            "Kondo Kenichi"
        ],
        "tags": [
            "Comedy",
            "Drama",
            "Horror",
            "Shounen",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "001fdacd"
    },
    {
        "title": "Danshi Koukousei wo Yashinatai Onee-san no Hanashi",
        "infoURL": "https://www.mangaupdates.com/series.html?id=148072",
        "description": "When Soramoto Minoru’s parents left him with a heavy debt, the \"Onee-san\" next door saves him and takes him in. Thus begins Minoru’s new, strange life with the beautiful Onee-san that thinks he’s too cute and wants to keep him!\n",
        "year": "2018",
        "authors": [
            "Hideki"
        ],
        "tags": [
            "Comedy",
            "Ecchi",
            "Romance",
            "Shounen",
            "Slice of Life",
            "Female Yandere",
            "Straight"
        ],
        "id": "d7f7cfe4"
    },
    {
        "title": "Dead Tube",
        "infoURL": "https://www.mangaupdates.com/series.html?id=109508",
        "description": "Distributing thrilling videos in secret. A school game that puts life and death on the line.\n",
        "year": "2014",
        "authors": [
            "YAMAGUCHI Mikoto",
            "KITAKAWA Touta"
        ],
        "tags": [
            "Adult",
            "Horror",
            "Mature",
            "Mystery",
            "Romance",
            "School Life",
            "Shounen",
            "Tragedy",
            "Female Yandere",
            "Straight",
            "NSFW"
        ],
        "id": "5656e2ff"
    },
    {
        "title": "Diary About the Loving Care of High School Boys",
        "infoURL": "https://mangadex.org/title/ed779991-82e0-412e-81a3-5c817319cc30",
        "description": "",
        "year": "",
        "authors": [
            "Garakuta Koubou",
            "Misono"
        ],
        "tags": [
            "Oneshot",
            "Psychological",
            "Horror",
            "Female Yandere",
            "Straight"
        ],
        "id": "52b79385"
    },
    {
        "title": "Dokuzakura",
        "infoURL": "https://www.mangaupdates.com/series.html?id=156863",
        "description": "Beauty Queen, Idol, Hostess etc.\nRyougoku Atsushi, a college student with the power to see the “Favor” in others, lives a comfy life supported by beautiful women.\nBut one day, a girl calling herself his “childhood friend” appears, destroying his paradise. And maybe even his life…\nA harem suspense story, start!\n",
        "year": "2019",
        "authors": [
            "MITA",
            "YAMAMOTO Yamii"
        ],
        "tags": [
            "Adult",
            "Drama",
            "Harem",
            "Mature",
            "Shounen",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "9b1f80af"
    },
    {
        "title": "Dorei wo Choukyoushite Harem Tsukuru",
        "infoURL": "https://www.mangaupdates.com/series/buo9hov/",
        "description": "A man purchases three little slaves and begins to groom them into perfect girls for his harem.\n\nHentai chapters release as Dorei Wo Choukyoushite Harem Tsukuru R18 Route.\n\nRaw\n",
        "year": "2022",
        "authors": [
            "Aldehyde"
        ],
        "tags": [
            "Adult",
            "Comedy",
            "Fantasy",
            "Harem",
            "Slice of Life",
            "Female Yandere",
            "Straight"
        ],
        "id": "2527a16f"
    },
    {
        "title": "Domina no do!",
        "infoURL": "https://www.mangaupdates.com/series.html?id=29266",
        "description": "Tsuchie Takeshi has dreams of when he played with Hikari-chan as a child. He remembers her as a kind, sweet girl. However, one day on the way home from school, Takeshi is abducted and taken to a huge house, only to find out that she's become an arrogant, violent dominatrix (emphasis on violent). Furthermore, she says that he promised to marry her! How will he adjust to her new personality, and living with her as a new son of her prestigious family?\n",
        "year": "2008",
        "authors": [
            "ZAPPA Go",
            "MEGURO Sankichi"
        ],
        "tags": [
            "Adult",
            "Comedy",
            "Ecchi",
            "Harem",
            "Romance",
            "School Life",
            "Seinen",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "a1c0a2c7"
    },
    {
        "title": "Elfen Lied",
        "infoURL": "https://www.mangaupdates.com/series.html?id=413",
        "description": "The story involves human mutations called \"Diclonius\", who grow horns on their heads and possess telekinetic powers, in the form of invisible \"arms\" called vectors.\n\nThe tendency for violence among Diclonii varies among characters. Certain scientists contain them in a Facility in cells, where they are subject to inhumane experiments to test their abilities or where they await execution for being too dangerous.\n\nAn infectious virus is also associated with the mutation. This virus is spread through non-lethal contact with the vectors of a diclonius. The main non-mutant character in the story is Kouta, who ends up becoming increasingly involved with these dicloniuses, as they seek refuge from the scientists.\n\nThe main diclonius character is Lucy/Nyuu, a killer whose alter ego is a hapless and very cute child whose vocabulary and intelligence are quite limited.\n\n",
        "year": "2002",
        "authors": [
            "OKAMOTO Lynn"
        ],
        "tags": [
            "Action",
            "Adult",
            "Horror",
            "Mature",
            "Psychological",
            "Romance",
            "Sci-fi",
            "Seinen",
            "Supernatural",
            "Tragedy",
            "Female Yandere",
            "Straight"
        ],
        "id": "ffbc3596"
    },
    {
        "title": "Enma no Hanayome",
        "infoURL": "https://www.mangaupdates.com/series.html?id=72136",
        "description": "Onizaki Teppei is a high-school freshman who just wants to live a plain student life, but his world is rudely shaken by a mysterious girl, Mitogawa Enma, who declares her intent to find a husband at the school!\n",
        "year": "2011",
        "authors": [
            "YUUKI Sakuya"
        ],
        "tags": [
            "Action",
            "Comedy",
            "Ecchi",
            "Fantasy",
            "Harem",
            "Romance",
            "School Life",
            "Seinen",
            "Female Yandere",
            "Straight"
        ],
        "id": "3a147bd1"
    },
    {
        "title": "Ex vs. Stalker",
        "infoURL": "https://www.mangaupdates.com/series.html?id=168204",
        "description": "An online store model, Juyeon Ye, wakes up and finds herself tied up in an abandoned school. It was her ex-boyfriend who kidnapped her, and there was no one to come to the rescue. \nThe only person who was aware of her absence was her stalker, who had been following her since the horrible blind date. Now, she has to depend on the stalker to escape, and the tension between her ex and the stalker continues to intensify...\n\nOriginal Webtoon: \nR19: Comico, Lezhin, MrBlue, Onestory, Nate\nR15: Comico, Bomtoon, Lezhin, MrBlue, Onestory, Nate\n\nOfficial Translations:\nR19: English\n\nKidnapped by her ex-boyfriend, only the stalker is in the know!\n\nThe fitting model Ju Yeon, who had just emerged as a star on social media, wakes up to find herself tied up in a dark school. Her kidnapper, a man named Nam Woo, is her ex-boyfriend. Ju Yeon had just reached a turning point in her life. But while she was being threatened by her ex-boyfriend at that moment, Ju Yeon's stalker, Park Su, was watching the two while keeping his mouth shut inside the shadows!\n\n",
        "year": "2020",
        "authors": [
            "Yang-Uk",
            "Ok-Keu"
        ],
        "tags": [
            "Drama",
            "Horror",
            "Josei",
            "Mature",
            "Mystery",
            "Psychological",
            "Seinen",
            "Tragedy",
            "Male Yandere",
            "Straight"
        ],
        "id": "fd835f67"
    },
    {
        "title": "Fox Daughter",
        "infoURL": "https://mangadex.org/title/5b3efa84-b1b7-443a-a011-5af084c5ccff",
        "description": "A happy fox god is excited that a guy she liked has come back to her. Then she realizes how much time has passed, and her suffering begins!\n\n---\n[Buy on Melonbooks](https://www.melonbooks.co.jp/detail/detail.php?product_id=117855)",
        "year": "2015",
        "authors": [
            "Barikios"
        ],
        "tags": [
            "Oneshot",
            "Psychological",
            "Romance",
            "Horror",
            "Monster Girls",
            "Supernatural",
            "Tragedy",
            "Female Yandere",
            "Straight"
        ],
        "id": "fe2102ff"
    },
    {
        "title": "Fujimi no Shinu Ko-san",
        "infoURL": "https://www.mangaupdates.com/series.html?id=174346",
        "description": "Original Web Manga: Shounen Jump Rookie, Pixiv, Nico Nico Seiga\n",
        "year": "2020",
        "authors": [
            "Furo"
        ],
        "tags": [
            "Comedy",
            "Romance",
            "School Life",
            "Shounen",
            "Slice of Life",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "ae62c888"
    },
    {
        "title": "Fumetsu no Anata e",
        "infoURL": "https://www.mangaupdates.com/series.html?id=137169",
        "description": "An immortal being was sent to the surface of the earth and met a boy living alone in the middle of tundra. The being can take the shape of dying things, but only if the \"impetus\" is stronger than the previous one. What sort of experiences and meetings will the being encounter while living forever?\n",
        "year": "2016",
        "authors": [
            "OOIMA Yoshitoki"
        ],
        "tags": [
            "Action",
            "Adventure",
            "Drama",
            "Romance",
            "School Life",
            "Shounen",
            "Supernatural",
            "Male Yandere",
            "Female Yandere",
            "Straight"
        ],
        "id": "e5dc57d9"
    },
    {
        "title": "Fumou Renai",
        "infoURL": "https://www.mangaupdates.com/series.html?id=165814",
        "description": "My first love isn't over yet --- Zakuro, who died after being run over by a car at the meeting place for her first date. Mikito, who was withdrawn due to shock, vowed to revive and made his university debut, the first joint party! When I thought that it was a good feeling with the beautiful woman I met, Onoda, a ghostly ghost appeared !? \"Because I can't become a Buddhahood until I have a lover more than me.\" A crazy pure love story between two crazy people!\n",
        "year": "2020",
        "authors": [
            "HANADA Momo"
        ],
        "tags": [
            "Drama",
            "Romance",
            "Shoujo",
            "Slice of Life",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "819a2526"
    },
    {
        "title": "Gachi Koi Nenchakujuu: Net Haishinsha no Kanojo ni naritakute",
        "infoURL": "https://www.mangaupdates.com/series/dajpeyn",
        "description": "Kaguya Hinaki is a female college student who is highly regarded by her classmates because of her good looks. She had a secret she couldn't tell anyone, the secret being that she is genuinely in love with Subaru, a member of a certain streamer group. Hinaki, who really wants to go out with Subaru, receives a DM from a strange account one day, and Hinaki's life changes completely.\n",
        "year": "2020",
        "authors": [
            "Seira (星来)"
        ],
        "tags": [
            "Comedy",
            "Drama",
            "Josei",
            "Mystery",
            "Romance",
            "Female Yandere",
            "Straight"
        ],
        "id": "d1b66efd"
    },
    {
        "title": "Gisou Honey Trap",
        "infoURL": "https://www.mangaupdates.com/series.html?id=75321",
        "description": "Keiichirou Mishima is a 15-year-old guy living with his mom until she suddenly decides to fly to Paris to be with Keiichirou's dad. His mom arranges with his uncle Shirasaki to let him stay at his mansion with his two cousins Marie and Tomari, who he met many years before when he stayed with them for a short while. However, Keiichirou has forgotten nearly everything about back then, including why his cousins apparently now hate him.\n",
        "year": "2012",
        "authors": [
            "YOSHIZAWA Vanilla"
        ],
        "tags": [
            "Comedy",
            "Drama",
            "Gender Bender",
            "Lolicon",
            "Psychological",
            "Seinen",
            "Shotacon",
            "Shounen Ai",
            "Male Yandere",
            "Straight",
            "Gay"
        ],
        "id": "36f6931f"
    },
    {
        "title": "Hajimete no Gal",
        "infoURL": "https://www.mangaupdates.com/series/a5l2amy/hajimete-no-gal",
        "description": "High school boy Junichi Hashiba laments not having a girlfriend as his classmates have seemed to be pairing up everywhere. His single unattached friends force him into boldly confessing his love to Yukana Yame, a beautiful \"gal\" at the school. Although Yukana easily determines that Junichi really just wants to lose his virginity, she agrees to be his girlfriend. Junichi soon attracts the affections of other girls who have known Junichi or Yukana for a while, including his childhood friend and neighbor Nene, Yukana's gal friend Ranko, and the school's madonna Yui.\n",
        "year": "2015",
        "authors": [
            "UENO Meguru"
        ],
        "tags": [
            "Comedy",
            "Ecchi",
            "Harem",
            "Romance",
            "School Life",
            "Shounen",
            "Female Yandere",
            "Straight"
        ],
        "id": "0bf266b4"
    },
    {
        "title": "Haru to Natsu",
        "infoURL": "https://www.mangaupdates.com/series.html?id=47802",
        "description": "Makoto meets a sweet, shy girl named Haruna helping out at the school's athletics festival. He confesses his feelings for her the next time he sees her, and she bluntly rejects him, only to call him later and ask him out herself! The source of all these mixed signals is Haruna's \"evil\" twin sister, Natsumi. Natsumi is the opposite of Haruna, she's a forward, crude girl bent on trolling the hell out of her twin sister. Makoto is then stuck in the shenanigans between the two sisters, especially when Haruna shows that she's not one to be trifled with.\n\nIncluded one-shots:\nVolume 1: Hikaru challenge!, Detarame Machi no Kaigenshou.\n\n",
        "year": "2008",
        "authors": [
            "TAKEDA Sun"
        ],
        "tags": [
            "Comedy",
            "Ecchi",
            "Mature",
            "Romance",
            "School Life",
            "Seinen",
            "Female Yandere",
            "Straight"
        ],
        "id": "e4894673"
    },
    {
        "title": "Happy End For You",
        "infoURL": "https://www.mangaupdates.com/series.html?id=148718",
        "description": "",
        "year": "",
        "authors": [
            "NUMACHI Doromaru"
        ],
        "tags": [
            "Drama",
            "Horror",
            "Psychological",
            "Romance",
            "School Life",
            "Shoujo Ai",
            "Female Yandere",
            "Lesbian"
        ],
        "id": "989fb707"
    },
    {
        "title": "Happy Sugar Life",
        "infoURL": "https://www.mangaupdates.com/series.html?id=121918",
        "description": "Satou Matsuzaka doesn't seem to care about much, moving through boys and casting them aside like so used candy wrappers. All that changes, though, when she meets Shio. The little girl changes everything for Matsuzaka. Is this love...? If it is, then it's love through a very warped prism as the high schooler demonstrates there's no atrocity beyond her when it comes to protecting the object of her deranged affection.\n",
        "year": "2015",
        "authors": [
            "KAGISORA Tomiyaki"
        ],
        "tags": [
            "Drama",
            "Horror",
            "Mystery",
            "School Life",
            "Shoujo Ai",
            "Shounen",
            "Female Yandere",
            "Lesbian"
        ],
        "id": "90701c82"
    },
    {
        "title": "Hazure Skill \"Gacha\" de Tsuihou Sareta Ore wa, Wagamama Osananajimi o Zetsuen Shi Kakusei Suru",
        "infoURL": "https://www.mangaupdates.com/series/5l2yb1l/",
        "description": "Crest was born as the fifth son of a duke. However, as the fifth son, he was in no position to talk. His childhood friend and also his fiancée, Ellis, treated him just like a slave. And on Crest's coming-of-age ceremony, he received a skill called \"Gacha.\" Yet, he wasn't able to learn how to use it and was banished away from his home. Banished into the forest full of monsters, Crest began to understand the power \"Gacha.\" And then, Crest made up his mind. He will definitely survive and get back on his feet.\n",
        "year": "2020",
        "authors": [
            "KIJIMA Ryuuta",
            "Eshika/Shogo"
        ],
        "tags": [
            "Action",
            "Adventure",
            "Fantasy",
            "Harem",
            "Romance",
            "Female Yandere",
            "Straight"
        ],
        "id": "353496ec"
    },
    {
        "title": "Head Over Heels (Prishe)",
        "infoURL": "https://www.mangaupdates.com/series.html?id=162191",
        "description": "Woohyun is rich, good-looking and popular… but he also happens to be a total bully. His punching bag is Ha Yan, a stuttering and amenable girl in his class. Woohyun likes nothing more than harassing her… The weird thing is, Ha Yan actually seems to crave his attention, feeding off it. As they each spin a web of deceit to ensnare the other, who will end up getting caught? And could romance bloom from this tangled, thorny mass of obsession?\n\nOriginal Webtoon\nOfficial English\nOfficial Japanese\n",
        "year": "2019",
        "authors": [
            "South Star",
            "Prishe"
        ],
        "tags": [
            "Mature",
            "Psychological",
            "Romance",
            "School Life",
            "Male Yandere",
            "Female Yandere",
            "Straight"
        ],
        "id": "a1002bbd"
    },
    {
        "title": "Henai Girl",
        "infoURL": "https://www.mangaupdates.com/series/jhufzj6/henai-girl",
        "description": "Super rich ojousama, Aiu Eiko is passionately in love with her classmate, Nagi Nagisa. The daily life of a little (?) weird high school girl.\n",
        "year": "2019",
        "authors": [
            "Sato Shoki"
        ],
        "tags": [
            "Comedy",
            "Ecchi",
            "School Life",
            "Shoujo Ai",
            "Slice of Life",
            "Female Yandere",
            "Lesbian"
        ],
        "id": "c3d6f0db"
    },
    {
        "title": "Hiai Mousou",
        "infoURL": "https://www.mangaupdates.com/series.html?id=102202",
        "description": "A teacher named Kadomae Kazuma has the principal's daughter Noeda Kanade for his class in a new school semester. At first glance, she appears to be a quiet girl, but she's awakening her aberrant love towards Kazuma? This is a psycho love story that accelerates thoughts and actions.\n",
        "year": "2013",
        "authors": [
            "NAKAMURA Uzuki"
        ],
        "tags": [
            "Adult",
            "Drama",
            "Horror",
            "School Life",
            "Seinen",
            "Female Yandere",
            "Straight"
        ],
        "id": "1aef3526"
    },
    {
        "title": "Higurashi no Naku Koro ni Meguri",
        "infoURL": "https://www.mangaupdates.com/series.html?id=190334",
        "description": "Based on Higurashi Gou and Sotsu, it's the manga version of the answer arc!\n\nAfter overcoming the repeating June of 1983, Rika Furude has proactively decided to live in a future she has yet to see, but... why are these repeating tragedies happening, and how are they occurring?\n\nThe curtain rises on a new chapter revealing a girl who tries to deceive fate. Countless choices are made, cycling through destiny, as she reaches for an answer.\n",
        "year": "2021",
        "authors": [
            "AKASE Tomato"
        ],
        "tags": [
            "Action",
            "Mystery",
            "Seinen",
            "Supernatural",
            "Female Yandere",
            "Lesbian"
        ],
        "id": "ed8662ef"
    },
    {
        "title": "Hone no Nazuki Made Aisu",
        "infoURL": "https://www.mangaupdates.com/series.html?id=146339",
        "description": "\"I came back as promised, and I've become pretty just for you. That's why, with this, will you love me?\"\n\nOriginal Webtoon\n",
        "year": "2016",
        "authors": [
            "Awayuki"
        ],
        "tags": [
            "Mature",
            "Psychological",
            "School Life",
            "Tragedy",
            "Yuri",
            "Female Yandere",
            "Lesbian"
        ],
        "id": "f1cb28dd"
    },
    {
        "title": "Hotaru no Yomeiri",
        "infoURL": "https://www.mangaupdates.com/series/a6lgb40/",
        "description": "A romance story set in the Meiji era about a young lady who, with only a short time left to live, decides to marry a professional killer. \n\nOriginal Web Publication\n",
        "year": "2023",
        "authors": [
            "TACHIBANA Oreco"
        ],
        "tags": [
            "Drama",
            "Historical",
            "Mature",
            "Psychological",
            "Romance",
            "Shoujo",
            "Male Yandere",
            "Straight"
        ],
        "id": "ebbbe7f6"
    },
    {
        "title": "Household Affairs",
        "infoURL": "https://www.mangaupdates.com/series.html?id=126242",
        "description": "Neglected wife commits adultery with the delivery boy, but unbeknownst to her, her husband is an assassin.\n\nOriginal Webtoon:\nLezhin, MrBlue, Toomics, Toptoon, Peanutoon, BookCube, Comico\n",
        "year": "2015",
        "authors": [
            "ButcherBOY"
        ],
        "tags": [
            "Action",
            "Adult",
            "Drama",
            "Mature",
            "Romance",
            "Seinen",
            "Female Yandere",
            "Straight",
            "NSFW"
        ],
        "id": "08deb9dc"
    },
    {
        "title": "I Love Amy",
        "infoURL": "https://www.mangaupdates.com/series/6xqdlt7/i-love-amy",
        "description": "\"Is this how it feels to have a friend?\" Bibi is obsessed with Peter, the prince of the school. When she spots Amy next to him, she starts to feel jealous. She invites Amy to her house to warn her, but instead takes a liking to the girl. They agree to be friends on the condition that Amy has to help Bibi confess.\n\nOriginal Webtoon\n",
        "year": "2022",
        "authors": ["Unun"],
        "tags": [
            "Drama",
            "Romance",
            "School Life",
            "Shoujo Ai",
            "Female Yandere",
            "Straight",
            "Raw"
        ],
        "id": "3c3683ee"
    },
    {
        "title": "I was Wrong",
        "infoURL": "https://www.mangaupdates.com/series.html?id=150023",
        "description": "Furuya has finally escaped from his yandere girlfriend Sara. It was so simple—all he had to do was kill her. But it seems that not even death can separate them, as she lingers as a ghost due to her regrets. Back when Sara was alive, Furuya felt her looming presence at every turn; now, as a spirit, she is like any normal girl. Perhaps he had misinterpreted her the whole time. As his guilt piles up, Furuya feels like he has to atone for his actions—but at what cost?\n",
        "year": "2018",
        "authors": [
            "Hakuri"
        ],
        "tags": [
            "Horror",
            "Psychological",
            "Romance",
            "School Life",
            "Shounen",
            "Supernatural",
            "Tragedy",
            "Female Yandere",
            "Straight"
        ],
        "id": "e2f2904c"
    },
    {
        "title": "Ibitsu",
        "infoURL": "https://www.mangaupdates.com/series.html?id=48080",
        "description": "A boy went to take his trash out late one night, and found a strange, creepy, gothic-lolita-dressed woman sitting amongst the garbage bags. She asked if he had a little sister, and he answered her, hurrying afterwards back to his apartment. When he looked out the window, she was gone. Who is the strange woman, and why does she give him such a bad feeling?\n",
        "year": "2009",
        "authors": [
            "RYOU Haruto"
        ],
        "tags": [
            "Horror",
            "Seinen",
            "Supernatural",
            "Tragedy",
            "Female Yandere",
            "Straight"
        ],
        "id": "eb258053"
    },
    {
        "title": "Ichatsuki Taino -",
        "infoURL": "https://www.mangaupdates.com/series.html?id=16219",
        "description": "From Shoujo Manga Maniac:\nYugao's grandfather privately owned library stands on a precipice. In this library there is a special room which filled with occult-related books. It is rumored that the room is cursed. Kiryu, a serious man, works alone in this mysterious room. He is crazy about giving lessons to people. Yugao is very fond of him, so she one day she kissed him and he becomes a different person in his attitudes about sex.\n",
        "year": "2006",
        "authors": [
            "AMANE Yuko"
        ],
        "tags": [
            "Mature",
            "Romance",
            "Shoujo",
            "Smut",
            "Supernatural",
            "Male Yandere",
            "Female Yandere",
            "Straight"
        ],
        "id": "45cd3a32"
    },
    {
        "title": "Ijima Yabai Yatsu",
        "infoURL": "https://www.mangaupdates.com/series.html?id=150386",
        "description": "[It is not just \"bullying.\"] Nakajima was ruling over the class as a \"bully.\" The subject of bullying is a fragile girl, Shirasaki-san. Going as far as violence, every day was horrible. Everyone in the class pretends to not see it. If they stop, then they will be the next target. Nakajima performs \"bullying\" as if possessed. It was clear that something was wrong. Why does he do such brutal acts? The reality is terrible—\n",
        "year": "2018",
        "authors": [
            "Nakamura Nan"
        ],
        "tags": [
            "Comedy",
            "Harem",
            "Horror",
            "Mystery",
            "School Life",
            "Shounen",
            "Tragedy",
            "Female Yandere",
            "Straight"
        ],
        "id": "2a75add1"
    },
    {
        "title": "Ijousha no Ai",
        "infoURL": "https://www.mangaupdates.com/series.html?id=140718",
        "description": "The demon in human form. An innocent girl sacrificed. Kazumi Ichinose. 16 years old. high school student. Midou Saki fell in love with him when he was an elementary school student. That was the beginning of hell. Jealousy. Obsession. Pools of Blood. Tears. Death. Common sense, words, nothing makes sense. Misfortune befell those loved by \"him\". Love starts with blood. This is the beginning.\n",
        "year": "2017",
        "authors": [
            "CHIDA Daisuke"
        ],
        "tags": [
            "Adult",
            "Horror",
            "Mature",
            "School Life",
            "Shounen",
            "Tragedy",
            "Female Yandere",
            "Straight",
            "NSFW"
        ],
        "id": "3a835fd3"
    },
    {
        "title": "Itoshi no Ko, Charlotte",
        "infoURL": "https://www.mangaupdates.com/series.html?id=158052",
        "description": "Orphans Charlotte and William finally confess their feelings for each other and promised to be together forever. Yet, Charlotte is suddenly killed in a motor accident, leaving William devastated. Death is usually the end of most relationships, but it seems that Will has other plans...\n\n(Source: MangaDex)\n",
        "year": "2019",
        "authors": [
            "NAGAWA Tomo"
        ],
        "tags": [
            "Comedy",
            "Horror",
            "Romance",
            "Shoujo",
            "Slice of Life",
            "Supernatural",
            "Tragedy",
            "Male Yandere",
            "Straight"
        ],
        "id": "37d63b2d"
    },
    {
        "title": "Itoshi no Living Dead",
        "infoURL": "https://www.mangaupdates.com/series/0ea669c/itoshi-no-living-dead",
        "description": "In a world where the living dead run rampant, Lily and Cult are two necromancers whose purpose is to fight them.\n\nIncluded in \"Jibaku Shounen Hanako-kun 0.\"\n",
        "year": "2013",
        "authors": [
            "AIDA Iro"
        ],
        "tags": [
            "Action",
            "Adventure",
            "Drama",
            "Romance",
            "Shounen",
            "Tragedy",
            "Male Yandere",
            "Straight"
        ],
        "id": "ad214274"
    },
    {
        "title": "It's Mine",
        "infoURL": "https://www.mangaupdates.com/series.html?id=153168",
        "description": "There’s nothing that Yohan Do doesn’t know about his crush, Dajeong. Where she sits in class, works after school... and even where she lives. But unable to approach her, he watches her every move from afar and will do anything to protect her. Anything.\n\nOriginal Webtoon:\nNaver Webtoon, Naver Series\n\nOfficial Translation:\nEnglish, T.Chinese, Thai, Indonesian, Spanish\n",
        "year": "2018",
        "authors": [
            "Lucks"
        ],
        "tags": [
            "Action",
            "Drama",
            "Mature",
            "Psychological",
            "Romance",
            "School Life",
            "Male Yandere",
            "Straight"
        ],
        "id": "b7962e5f"
    },
    {
        "title": "Isekai Shoukan wa Nidome Desu",
        "infoURL": "https://www.mangaupdates.com/series.html?id=149154",
        "description": "There was once a man who was summoned to another world, and saved it. Of course, he became too popular there, and turned into an isekai-normie. However, that man fell into a \"trap\", and was forcibly returned to his original world. Moreover, he had to start over as a baby! \n\nThis is the story of the way-too-fantastic ex-hero who lived as a gloomy high-schooler, as he gets summoned once again to that same other world in a very unexpected development!\n\nOriginal Web Manga\nOfficial English Translation\n",
        "year": "2018",
        "authors": [
            "Kishimoto Kazuha",
            "Arashiyama"
        ],
        "tags": [
            "Action",
            "Adventure",
            "Comedy",
            "Ecchi",
            "Fantasy",
            "Harem",
            "Romance",
            "Shounen",
            "Male Yandere",
            "Gay"
        ],
        "id": "684ad4c5"
    },
    {
        "title": "Iwaihime",
        "infoURL": "https://www.mangaupdates.com/series.html?id=125447",
        "description": "Hajakenshou. Crush evil, spread the truth. It is said that each generation, upon reaching a certain age, all boys of the Susuharai family leave home and become independent. Then, relying only on themselves, they train body and soul until they are accepted as adults. And so I prepared myself for this day, learning a great many things so I’d be ready to live on my own.\n\nSusuda Prefectoral High School. My new school. Originally, I planned to enter in first year rather than transfer in second year. Life at school is carefree, and even pleasant. Everyone has a great time in class 2-A.\n\nThere’s just… her, Toe Kurokami. “Weird” doesn’t begin to describe her. Always holding that Japanese doll against her chest, never letting go for a second. Some whisper it is a cursed doll, whose hair grows when no one is looking. But it’s just an uncanny doll, with nothing special about it.\n\nYet, perhaps my meeting that girl was fate…\n\nNo, it was fate.\n\n",
        "year": "2015",
        "authors": [
            "DMM",
            "Ryukishi 07",
            "TANAKA Tomo"
        ],
        "tags": [
            "Horror",
            "Mature",
            "Mystery",
            "Psychological",
            "Seinen",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "4779cbf9"
    },
    {
        "title": "Jinsei 2-Shuume wa Yandere Kareshi wo Amayakashite Happy End ni Narimasu!!",
        "infoURL": "https://www.mangaupdates.com/series/5diewby/jinsei-2-shuume-wa-yandere-kareshi-wo-amayakashite-happy-end-ni-narimasu",
        "description": "Must avoid the death route!  ??\n Route selection romantic comedy ☆\n\n On the day of the high school graduation ceremony, Himari Ichinose was pushed down by her boyfriend, Shien Taniguchi, and died ... I thought, but when she woke up, time was back in the second year of high school !!\n In order to avoid the route where she is killed by Shien, the struggle for the second lap of Himari's life begins !!\n\n\n\n Original Web Manga \n",
        "year": "2021",
        "authors": [
            "KAKITSUBATA Waka"
        ],
        "tags": [
            "Comedy",
            "Mystery",
            "Romance",
            "Shoujo",
            "Male Yandere",
            "Straight"
        ],
        "id": "66c54010"
    },
    {
        "title": "Jishou Kanojo no Kouhai ga Iiyottekuru Hanashi",
        "infoURL": "https://mangadex.org/title/bc505bf0-bae9-4304-b0f8-93a0cb1c9056/",
        "description": "A 5-part one-shot about a beautiful girl flirting with her self-proclaimed boyfriend.",
        "year": "2023",
        "authors": [
            "Manten"
        ],
        "tags": [
            "Oneshot",
            "Romance",
            "Comedy",
            "School Life",
            "Web Comic",
            "Gyaru",
            "Female Yandere",
            "Straight"
        ],
        "id": "28effe7e"
    },
    {
        "title": "Kage no Jitsuryokusha ni Naritakue",
        "infoURL": "https://www.mangaupdates.com/series.html?id=152254",
        "description": "Great heroes and diabolical villains are the types of characters that people long to be—but not Cid Kagenou. He longs to become the true mastermind behind it all, pulling the strings, and having his machinations drive the entire story. In his previous life in modern-day Japan, he was not able to achieve his goals. But now, reborn into a world of magic, he will show the true eminence of shadow!\n\nAs Cid pretends to be just another average mob character, he recruits members to his (fake) organization Shadow Garden, aiming to take down the mysterious cult who lurks in the shadows. With plenty of ad-libs, Cid leads his (fake) organization against the foul (yet surprisingly real) Diabolos Cult.\n\n",
        "year": "2018",
        "authors": [
            "AIZAWA Daisuke",
            "SAKANO Anri"
        ],
        "tags": [
            "Action",
            "Adventure",
            "Comedy",
            "Drama",
            "Ecchi",
            "Fantasy",
            "Harem",
            "Shounen",
            "Female Yandere",
            "Straight",
            "Incest"
        ],
        "id": "60eed653"
    },
    {
        "title": "Kantai Collection dj - Anata no Yami Chinjufu",
        "infoURL": "https://www.mangaupdates.com/series.html?id=157330",
        "description": "",
        "year": "2018",
        "authors": [
            "Bacius"
        ],
        "tags": [
            "Doujinshi",
            "Ecchi",
            "Shounen",
            "Female Yandere",
            "Straight"
        ],
        "id": "31df0395"
    },
    {
        "title": "Kankinkon (Kondou Shigure)",
        "infoURL": "https://www.mangaupdates.com/series.html?id=147647",
        "description": "",
        "year": "2018",
        "authors": [
            "KONDOU Shigure"
        ],
        "tags": [
            "Adult",
            "Drama",
            "Romance",
            "Seinen",
            "Female Yandere",
            "Raw",
            "NSFW"
        ],
        "id": "4058a22d"
    },
    {
        "title": "Kanojo no Shifuku ga Dotaipusugita Ken",
        "infoURL": "https://mangadex.org/title/fe0438be-bf71-4fa8-9a9d-56db420ab071/",
        "description": "A guy is delighted to discover that his new girlfriend's casualwear fits his likes perfectly.",
        "year": "2021",
        "authors": [
            "Yamamoto Momo"
        ],
        "tags": [
            "Oneshot",
            "Psychological",
            "Romance",
            "Web Comic",
            "Female Yandere",
            "Straight"
        ],
        "id": "d744d015"
    },
    {
        "title": "Karakasa no Saien",
        "infoURL": "https://www.mangaupdates.com/series.html?id=22145",
        "description": "Ibusuki Rokusuke is unlucky enough to have a girl who's downright crazy for him. While trying to escape her twisted idea of love, he sneaks into an inn... which happens to be run by a witch who does not appreciate it when people try to stay without paying first.\n\n...oh, and the crazy girl got there before him. Poor guy...\n",
        "year": "2008",
        "authors": [
            "HIKAGI Tatsuhiko"
        ],
        "tags": [
            "Comedy",
            "Romance",
            "Seinen",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "37d24f3b"
    },
    {
        "title": "Kareshi ni Donhiki Saretai Minamoto-san",
        "infoURL": "https://www.mangaupdates.com/series.html?id=156308",
        "description": "Riri-chan a yandere who gets rejected by too many boyfriends because of her behavior decided to commit suicide until a young man saves and confess to her that he loves her but Riri-chan however couldn't trust that person and must make sure  if he would gain her trust\n",
        "year": "2019",
        "authors": [
            "Kohitsuji no Niku"
        ],
        "tags": [
            "Comedy",
            "Romance",
            "Seinen",
            "Male Yandere",
            "Female Yandere",
            "Straight"
        ],
        "id": "adf14963"
    },
    {
        "title": "Kedamono-tachi no Jikan - Kyouizonshou Kougun",
        "infoURL": "https://www.mangaupdates.com/series.html?id=176873",
        "description": "Airi Hirakawa, a model in a popular woman magazine, is suddenly hit by someone in front of her house and wakes up in a room full of garbage. Airi is confused when she is suddenly proposed by Hirokazu Imai, the man who is her kidnapper and stalker.\n\nAnd this is how her life of confinement begins, where suffers sexual violence and where even toilet breaks and meals are managed. \n\n*WARNING*\n\n*Contains kidnapping, rape, moral degradation, sexual abuse, sadism etc.\n",
        "year": "2019",
        "authors": [
            "big brother"
        ],
        "tags": [
            "Drama",
            "Horror",
            "Josei",
            "Mature",
            "Psychological",
            "Tragedy",
            "Male Yandere",
            "Straight",
            "NSFW"
        ],
        "id": "4e4ebe40"
    },
    {
        "title": "Kimi ni Aisarete Itakatta",
        "infoURL": "https://www.mangaupdates.com/series.html?id=148874",
        "description": "Kanae is a girl who is struggling to fit in with the popular clique at her high school. Because she had been bullied in middle school, she has developed an acute inferiority complex that had led her to engage in compensated dating in order to feel wanted. \n\nIn comes Hiroshi, a high-school baseball star who became drawn to her after finding her crying during a group date at a karaoke bar. Thus begins an unhealthy relationship between a mentally unstable high-school girl and a jock.\n",
        "year": "2017",
        "authors": [
            "SHIRUKA Bakaudon"
        ],
        "tags": [
            "Adult",
            "Drama",
            "Psychological",
            "Romance",
            "School Life",
            "Seinen",
            "Tragedy",
            "Female Yandere",
            "Straight"
        ],
        "id": "c7daae26"
    },
    {
        "title": "Kimi Ni Koisuru Satsujinki",
        "infoURL": "https://www.mangaupdates.com/series.html?id=176028",
        "description": "Suzuki Ryuto is an introverted, timid college student. Every day he puts on a fake smile, trying his best to blend into a group of outgoing students even despite cruel teasing over his virginity.\nOne day he comes to a drinking party where he meets a beautiful girl, Kokoa. Per her request, he pretends to be her boyfriend to ward off the stalker who has been harassing the girl. Their tender love leads to great tragedy.\n\nOriginal Manga\nOfficial  English (Comikey)\n",
        "year": "2020",
        "authors": [
            "AKIYAMA Enma"
        ],
        "tags": [
            "Horror",
            "Mature",
            "Psychological",
            "Romance",
            "Shounen",
            "Tragedy",
            "Male Yandere",
            "Straight",
            "Harem"
        ],
        "id": "e4991a80"
    },
    {
        "title": "Kimi wa Shinenai Hai Kaburi no Majo",
        "infoURL": "https://www.mangaupdates.com/series.html?id=172306",
        "description": "The meeting between a normal boy and a witch liberates the world from its curse...\n\nI'm a magic apprentice. \"My master,\" who has been living under this same run-down roof with me, is a shut-in girl who proclaimed herself to be a great witch. Despite sounding all high-and-mighty, my defenseless master loves to watch her disciple cooking for her. Our daily lives, filled with happiness, go by quietly. However, little did I know that behind that quiet, happy daily life is a terrible secret that involves the fate of the world...\n",
        "year": "2020",
        "authors": [
            "Hainumi",
            "FUUGETSU Makoto"
        ],
        "tags": [
            "Comedy",
            "Fantasy",
            "Romance",
            "Seinen",
            "Tragedy",
            "Female Yandere",
            "Straight"
        ],
        "id": "e7eef60a"
    },
    {
        "title": "Kitanai Kimi ga ichiban kawaii",
        "infoURL": "https://www.mangaupdates.com/series/2fmpqib/kitanai-kimi-ga-ichiban-kawaii",
        "description": "Sezaki Airi and Hanamura Hinako. They are from different groups and castes class, but they have a secret that cannot be told to others. After class, in the chemistry lab, they have an affair that makes them want to cover their eyes. The secret of the girls is love, selfishness and fetish...\n",
        "year": "2019",
        "authors": [
            "Manio."
        ],
        "tags": [
            "Psychological",
            "Romance",
            "School Life",
            "Tragedy",
            "Yuri",
            "Female Yandere",
            "Lesbian"
        ],
        "id": "592821ae"
    },
    {
        "title": "Koharu no Hibi",
        "infoURL": "https://www.mangaupdates.com/series.html?id=40603",
        "description": "From Animexis:\nOn his way to school, Torii Akira helps a girl who was about to fall down. From that moment he keeps running into that girl, and she seems very happy to see Akira. Could this be the reason Akira can't help but smile all day?\n",
        "year": "2009",
        "authors": [
            "OOSHIRO Youkou"
        ],
        "tags": [
            "Comedy",
            "Drama",
            "Psychological",
            "Romance",
            "School Life",
            "Seinen",
            "Female Yandere",
            "Straight"
        ],
        "id": "3043702c"
    },
    {
        "title": "Koi ka Mahou ka Wakaranai!",
        "infoURL": "https://www.mangaupdates.com/series.html?id=174615",
        "description": "Miyamae Kaito can't use magic at all! At this rate, his promise with his childhood friend of becoming great magic-wielders together will be ruined... When he was about to give up on his dream, Kaito suddenly feels magic power. However, that was magic that makes people who meet his eyes fall in love with him, a \"charming magic\"! Being popular is fine and all, but is this kind of magic really alright!? An envious fantasy love comedy of dreams and magic— the luckiest harem academy life, begins!\n",
        "year": "2020",
        "authors": [
            "Attsun"
        ],
        "tags": [
            "Action",
            "Comedy",
            "Ecchi",
            "Fantasy",
            "Harem",
            "Romance",
            "Shounen",
            "Slice of Life",
            "Female Yandere",
            "Straight"
        ],
        "id": "1e8bb160"
    },
    {
        "title": "Koi to Shinzou",
        "infoURL": "https://www.mangaupdates.com/series/0edt2d3/koi-to-shinzou",
        "description": "Freshman Yo Yagisawa actually has plenty of problems. But when a complete stranger introduces himself as her childhood friend and just moves in with her, the hustle and bustle really starts! Suddenly, the most creepy things start to happen around her. Who is this guy and is Yo in danger?\n",
        "year": "2017",
        "authors": [
            "KAIDOU Chitose"
        ],
        "tags": [
            "Comedy",
            "Drama",
            "Mystery",
            "Psychological",
            "Romance",
            "School Life",
            "Shoujo",
            "Male Yandere",
            "Straight"
        ],
        "id": "83fa783d"
    },
    {
        "title": "Koibito wa Oni no Hime",
        "infoURL": "https://www.mangaupdates.com/series.html?id=159663",
        "description": "I, Hayato, once met an Oni princess when I was young, and I made a promise to marry her when I became eighteen. But after that day, I was predisposed to experiencing ecchi disasters whenever I touch women. With the cause unknown, I intended to live out my life in high school without ever finding a girlfriend. But on that faithful day, Sakura, the Oni princess grown up, came back as promised.\n\nThis is the tale of an Oni Princess x High School Boy and the mystery of the ecchi Curse Charm that circles them.\n",
        "year": "2019",
        "authors": [
            "Saho"
        ],
        "tags": [
            "Comedy",
            "Ecchi",
            "Romance",
            "Seinen",
            "Slice of Life",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "af5ea35d"
    },
    {
        "title": "Kokuminteki Idol ni natta Osananajimi ga, Boro Apartment ni Sunderu Ore no Tonari ni Hikkoshite Kita Ken",
        "infoURL": "https://www.mangaupdates.com/series/xlbr4og/",
        "description": "My childhood friend who became separated three years ago is dancing on TV as a top idol. And it was the childhood friend who moved to the next to my room to see it!?\n",
        "year": "2022",
        "authors": [
            "SAKAKIBARA Monsho",
            "AKARI Ryuryuu"
        ],
        "tags": [
            "Comedy",
            "Romance",
            "Female Yandere",
            "Straight"
        ],
        "id": "43093462"
    },
    {
        "title": "Kono Gomi o Nanto Yobu",
        "infoURL": "https://www.mangaupdates.com/series/qurvv3g",
        "description": "The girl I love is my brother's ex-girlfriend. She's a trashy girl who's clingy, stubborn, and takes advantage of my weaknesses. But I can't seem to stop our relationship.\n",
        "year": "2022",
        "authors": [
            "Tetsukazu"
        ],
        "tags": [
            "Comedy",
            "Drama",
            "Psychological",
            "Romance",
            "School Life",
            "Seinen",
            "Female Yandere",
            "Straight"
        ],
        "id": "496602de"
    },
    {
        "title": "Kono Kanojo wa Fiction Desu.",
        "infoURL": "https://www.mangaupdates.com/series.html?id=63098",
        "description": "From 1st Chapter:\n\nThe lead character is a naive boy who's fallen in love with an older girl who everyone considers a genius writer. He's so in love in fact, that he has forgotten for the last 2 months about his secret hobby. For the past 10 years he has been writing the \"character profile\" of a single girl. Her birth date, personality, hobbies, conversations, etc.... is all recorded in a large pile of notebooks. All this time this fictional girl has been his friend and lover, but now that he is in love with a real girl he decided to throw them all away. \n\nIn order to \"purify\" the notebooks, he decided to burn them at a nearby shrine. To his surprise, the senpai he's in love with was also there. It starts to rain and as they talk the girl confesses she's having trouble writing her novel due to inexperience. As the storm gets even stronger, the lead character believes that since she confessed her \"weakness\" to him it is OK for him to show her his own \"secret\". Filled with courage, the boy opens the bag where he brought all the notebooks... except that instead of notebooks, the bag now contains the girl (naked of course) he's been creating for the past 10 years!!\n\n",
        "year": "2011",
        "authors": [
            "WATANABE Shizumu"
        ],
        "tags": [
            "Comedy",
            "Ecchi",
            "Romance",
            "Shounen",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "527c43d3"
    },
    {
        "title": "Kure-nai",
        "infoURL": "https://www.mangaupdates.com/series/mgao9d5/kure-nai",
        "description": "Kurenai Shinkurou, a 16-year-old dispute mediator, is one day approached by the daughter of a powerful plutocratic family asking him to be her bodyguard.\n",
        "year": "2007",
        "authors": [
            "FURUYA Daisuke",
            "KATAYAMA Kentarou",
            "YAMAMOTO Yamato"
        ],
        "tags": [
            "Action",
            "Drama",
            "Ecchi",
            "Harem",
            "School Life",
            "Shounen",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "a6b38d18"
    },
    {
        "title": "Kuruoshii Hodo ni Anata o",
        "infoURL": "https://www.mangaupdates.com/series.html?id=127905",
        "description": "The daily lives of an extraordinarily jealous (yandere) girl, Hiyori Koharu, and her boyfriend, Minoru Fujito\n",
        "year": "2014",
        "authors": [
            "Honnosioli"
        ],
        "tags": [
            "Comedy",
            "Romance",
            "School Life",
            "Slice of Life",
            "Female Yandere",
            "Straight"
        ],
        "id": "ded230dc"
    },
    {
        "title": "Kyoudai hodo Chikaku Tooimono wa Nai",
        "infoURL": "https://www.mangaupdates.com/series.html?id=103019",
        "description": "Ane (Older sis) is uber perfect; she's beautiful, intelligent and is admired as the president of the student council. But, when it comes to her little brother, she goes nuts, unable to control her over-the-top obsession with him. Their days get even more chaotic surrounded by a bunch of oddballs, from a mentally-disturbed best friend, their little sister with a sister complex, an ex-punk convenience store manager, a hardcore masochist, a loli-con and more! Casual comedy perfect for filling your spare time.\n-jCafe24.net\n",
        "year": "2013",
        "authors": [
            "OGI Hatsumi",
            "FUYUJIMA Kure"
        ],
        "tags": [
            "Comedy",
            "Ecchi",
            "School Life",
            "Shounen",
            "Supernatural",
            "Female Yandere",
            "Straight",
            "Harem",
            "Incest"
        ],
        "id": "6114b6eb"
    },
    {
        "title": "Kyuusen no Shima",
        "infoURL": "https://www.mangaupdates.com/series.html?id=87955",
        "description": "Yuuma is summoned back to his home island after the death of his mother and asked to become the next head of the wealthy Nuenaki family. He has certain misgivings though and rejects the offer. However after the current head dies not a day after his arrival, he has no choice but to become involved.\n",
        "year": "2012",
        "authors": [
            "HIGASHIDA Yuusuke"
        ],
        "tags": [
            "Adult",
            "Drama",
            "Harem",
            "Horror",
            "Mystery",
            "Romance",
            "Seinen",
            "Supernatural",
            "Female Yandere",
            "Straight",
            "Incest"
        ],
        "id": "91a6f912"
    },
    {
        "title": "Life in Captivity with a Yandere Girlfriend",
        "infoURL": "https://mangadex.org/title/9ba20412-3fee-4cb7-97e4-aad8198ad962/",
        "description": "",
        "year": "2022",
        "authors": [
            "Pageratta"
        ],
        "tags": [
            "Oneshot",
            "Comedy",
            "Zombies",
            "Post Apocalyptic",
            "Web Comic",
            "Full Color",
            "Female Yandere",
            "Straight"
        ],
        "id": "a01d34f2"
    },
    {
        "title": "Living With a Kunoichi",
        "infoURL": "https://www.mangaupdates.com/series/85i1ngm",
        "description": "Tae, a beautiful 17-year-old girl, and Kotaro, a serious office worker. These two seemingly happy people have a secret they can't reveal to anyone - the rival ninjas of Iga and Kouga secretly live together in this laid-back romantic comedy!\n",
        "year": "2022",
        "authors": [
            "Pontogotanda"
        ],
        "tags": [
            "Comedy",
            "Romance",
            "Seinen",
            "Slice of Life",
            "Female Yandere",
            "Straight"
        ],
        "id": "1e0eeb4b"
    },
    {
        "title": "Love Dependency Disease",
        "infoURL": "https://www.mangaupdates.com/series.html?id=165522",
        "description": "Love dependency disease: I have a special body condition which will naturally attract some type of people to me, people commonly known as ——”yandere”.\nAbout my story, let me first come down from the surgeon’s table before speaking.\n“I won’t let you run away”\n“You’re mine”\n“I won’t let you be handed over to anyone else!”\n“Even if we die, we must still be together in the afterlife, remember that~”\nThe girls’ words, they still echo around my ears.\n\n(Source: MangaDex)\n",
        "year": "",
        "authors": ["杂音未来"],
        "tags": [
            "Comedy",
            "Drama",
            "Ecchi",
            "Harem",
            "Romance",
            "School Life",
            "Slice of Life",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "1ccaca2f"
    },
    {
        "title": "Love Fighter Shuravan",
        "infoURL": "https://www.mangaupdates.com/series.html?id=151425",
        "description": "In near future, Humanity discovered incredible ore with unlimited energy, 「Iliosdaite」. In ten years since its discovery that core energy became an alternate fuel supporting the whole world. But, a lot of Monsters and evil organizations were eager to get their hands on Iliosdaite. That's when a Hero rose up to protect the Peace. His name was..... Love Fighter Shuravan.\n",
        "year": "2017",
        "authors": [
            "AOKI Hayato"
        ],
        "tags": [
            "Action",
            "Comedy",
            "Harem",
            "Mecha",
            "Romance",
            "Sci-fi",
            "Shounen",
            "Female Yandere",
            "Straight"
        ],
        "id": "adf866bc"
    },
    {
        "title": "Love Parameter",
        "infoURL": "https://www.mangaupdates.com/series/7k3ml9q/love-parameter",
        "description": "A magic pair of glasses that turns getting girls into a video game? Get ready, because it's time to get all the girls! But things start to change as the relationships get complicated...\n\nOriginal Webtoon\n\nOfficial Translations:\nEnglish, T.Chinese\n\nYoung Hoon, a nerdy guy who always fails in love. He has problems understanding woman's feelings, hence always getting dumped by his girlfriends. But one day a mysterious guy appears and gives him special glasses, these glasses will change his life forever.\n",
        "year": "2015",
        "authors": [
            "Kkun",
            "Insane"
        ],
        "tags": [
            "Adult",
            "Harem",
            "School Life",
            "Seinen",
            "Supernatural",
            "Female Yandere",
            "Straight",
            "NSFW"
        ],
        "id": "630b3c92"
    },
    {
        "title": "Love/Death",
        "infoURL": "https://www.mangaupdates.com/series.html?id=109619",
        "description": "Shouko wants to kill her friend Akkii. Akkii wants to kill her friend Shouko. How come? Because they love each other so much! This is a story following the romance between two yandere high school girls.\n\nNote: The tankoubon volume contains another, separate short story called Nicochuu, plus an epilogue for the main plot of Love/Death.\n",
        "year": "2014",
        "authors": [
            "Kuzushiro"
        ],
        "tags": [
            "Action",
            "Comedy",
            "Mature",
            "School Life",
            "Shoujo Ai",
            "Female Yandere",
            "Lesbian"
        ],
        "id": "1efdf4e9"
    },
    {
        "title": "Me and My Yandere Girlfriends",
        "infoURL": "https://cubari.moe/read/imgur/J6alJc8/",
        "description": "",
        "year": "2022",
        "authors": ["kugatu28"],
        "tags": [
            "Female Yandere",
            "Straight",
            "Harem"
        ],
        "id": "597660a8"
    },
    {
        "title": "Menhera Shoujo Kurumi-chan",
        "infoURL": "https://www.mangaupdates.com/series.html?id=166114",
        "description": "\"My sister is beautiful, cheerful, bright, and family-oriented\", but she is actually a mentally unstable girl. This is the story of the younger brother \"Taichi\" who is swung around by his older sister \"Nanase Kurumi\".\n",
        "year": "2018",
        "authors": [
            "Pomu"
        ],
        "tags": [
            "Comedy",
            "Slice of Life",
            "Female Yandere",
            "Straight"
        ],
        "id": "87404310"
    },
    {
        "title": "Metronome",
        "infoURL": "https://www.mangaupdates.com/series/dn9fhjq/",
        "description": "A bloodstained man stands in front of a terrified girl. He proclaims his love for her and makes this ominous declaration: A year from now, she will either die alone or will be with him forever. Now, rumors abound about the cursed girl that causes any boy who proclaims his love for her to die. Join us to discover the mysteries of Metronome.\n\nOriginal Webtoon:\nDaum, KakaoPage\n",
        "year": "2010",
        "authors": [
            "LEE Won-Jin"
        ],
        "tags": [
            "Drama",
            "Fantasy",
            "Mystery",
            "Romance",
            "School Life",
            "Shoujo",
            "Supernatural",
            "Male Yandere",
            "Straight"
        ],
        "id": "85a1b250"
    },
    {
        "title": "Mirai Nikki",
        "infoURL": "https://www.mangaupdates.com/series.html?id=6765",
        "description": "Yukiteru \"Yuki\" Amano is a loner who never really interacts with people and prefers writing a diary on his cell phone with his imaginary friends Deus Ex Machina, the God of Time and Space, and Muru Muru, Deus's servant.\n However, Yuki soon learns that Deus is real when he makes Yuki participate in a battle royal with eleven other people. Within this \"Diary Game,\" the contestants are given special diaries that can predict the future, with each diary having unique features that give them both advantages and disadvantages.\n The rules of the game are simple: the contestants have 90 days to find and kill all the other contestants, and the last one standing will become the new God of Time and Space.\n\n",
        "year": "2006",
        "authors": [
            "Esuno Sakae",
            "ESUNO Sakae"
        ],
        "tags": [
            "Action",
            "Drama",
            "Mature",
            "Mystery",
            "Psychological",
            "Romance",
            "School Life",
            "Shounen",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "0af2166c"
    },
    {
        "title": "Miss Healer is Acting a Little Strange",
        "infoURL": "https://mangadex.org/title/4b3b9971-b877-4137-92b0-79de193296a4/",
        "description": "",
        "year": "",
        "authors": [
            "Yasuhara Hirokazu"
        ],
        "tags": [
            "Comedy",
            "Magic",
            "Fantasy",
            "Web Comic",
            "Female Yandere",
            "Straight"
        ],
        "id": "c7218ec3"
    },
    {
        "title": "Mina-sama no Omocha desu",
        "infoURL": "https://www.mangaupdates.com/series.html?id=142476",
        "description": "Tsukimiya is a dutiful kid who has been looking after his family since his mother's passing, and a popular pretty boy at school, but he rejects all those who confess to him due to an unrequited love he holds for one of his teachers. However he suddenly finds himself kidnapped by a group of beautiful women, who promise him a life of daily torture from now on.\n",
        "year": "2017",
        "authors": [
            "ISHII Yasuyuki"
        ],
        "tags": [
            "Adult",
            "Harem",
            "Horror",
            "Mature",
            "Shounen",
            "Tragedy",
            "Female Yandere",
            "Straight"
        ],
        "id": "f02372f0"
    },
    {
        "title": "Mousugu Shinu Hito",
        "infoURL": "https://www.mangaupdates.com/series.html?id=100868",
        "description": "Kominato Riku is a high-school student who aims to be a game designer. The girl next door is his childhood friend, Haju, who is in love with him, but he has fallen head over heels for the school idol Riko. And lastly, there is the transfer student, Nodoka. With that all said you’d think this is the start of some love-comedy harem, but a rumor spreads that Nodoka's received a message that says, “you will die soon”. Riku and the gang’s fate will change in a major way. Who will live, and who will love?\n\nOriginal Webcomic\n",
        "year": "2013",
        "authors": [
            "TAKEI Touka",
            "HARUSE Hiroki"
        ],
        "tags": [
            "Drama",
            "Harem",
            "Horror",
            "Mystery",
            "Psychological",
            "Romance",
            "Seinen",
            "Tragedy",
            "Female Yandere",
            "Straight"
        ],
        "id": "e933f14d"
    },
    {
        "title": "Murdist: Shikeishuu Kazami Tazuru ",
        "infoURL": "https://mangadex.org/title/091e2824-92ed-4f41-8640-fa5d2dd24f6b/murdist-shikeishuu-kazami-tazuru",
        "description": "Tazuru Kazami is a death row inmate who murdered 89 people in just a few years. With her murders gaining a reputation as beautiful \"art,\" the number of copycat crimes has recently skyrocketed and become a social problem. In the midst of this, the imprisoned Kazami offers to hand over information about the copycats on the condition that she speak to a certain someone. The young man she chooses is a run-of-the-mill college student.",
        "year": "2021",
        "authors": [
            "Handa Hotori",
            "Yutoto"
        ],
        "tags": [
            "Thriller",
            "Psychological",
            "Crime",
            "Police",
            "Mystery",
            "Adaptation",
            "Female Yandere",
            "Straight"
        ],
        "id": "b5475ca1"
    },
    {
        "title": "Mushihime",
        "infoURL": "https://www.mangaupdates.com/series.Mina-sama-no-Omocha-desu.html?id=99801",
        "description": "A dark romance story about a high school boy who falls helplessly in love with a beautiful girl who has to eat people to survive.",
        "year": "2013",
        "authors": ["HOKAZONO Masaya"],
        "tags": [
            "Drama",
            "Horror",
            "Mature",
            "Romance",
            "Schoole Life",
            "Seinen",
            "Psychological",
            "Female Yandere",
            "Straight",
            "Incest"
        ],
        "id": "674533f2"
    },
    {
        "title": "Mutual Love",
        "infoURL": "https://mangadex.org/title/20d74873-a9d2-4f9e-a2ae-221be54ed620",
        "description": "Another short twitter manga… Featuring another \"boy meets girl\" at school setting…\n**BUT WHAT COULD BE THE TWIST IN HERE?**",
        "year": "2020",
        "authors": [
            "Nekoashi Fumare"
        ],
        "tags": [
            "Psychological",
            "Romance",
            "Comedy",
            "Harem",
            "School Life",
            "Web Comic",
            "Male Yandere",
            "Female Yandere",
            "Straight"
        ],
        "id": "d6df5a33"
    },
    {
        "title": "My Deepest Secret",
        "infoURL": "https://www.mangaupdates.com/series.html?id=155683",
        "description": "Having a handsome, kind and caring boyfriend like Elios means the world to Emma. Even a look at him makes her heart flutters. But little does she know about a secret lies deep in their relationship. What is the said secret?\n\nOriginal Webtoon\n\nOfficial Translation: \nFrench, Spanish, German, Thai\n",
        "year": "2018",
        "authors": [
            "Hanza Art"
        ],
        "tags": [
            "Drama",
            "Josei",
            "Mystery",
            "Psychological",
            "Romance",
            "School Life",
            "Male Yandere",
            "Straight"
        ],
        "id": "26524f3f"
    },
    {
        "title": "My Divorced Crybaby Neighbour",
        "infoURL": "https://www.mangaupdates.com/series/6iulrmv/my-divorced-crybaby-neighbour",
        "description": "Ochiai-San is an ordinary woman who recently went through a divorce. Years of marital neglect have chipped away at her self-esteem, making her more reserved and depressed. However, there is one light at the end of her tunnel - her next door neighbor, Sawatari-kun. Can he help bring her back out of her shell?\n\nOriginal Twitter Comic (c.1)\n",
        "year": "2021",
        "authors": [
            "Zyugoya"
        ],
        "tags": [
            "Comedy",
            "Drama",
            "Romance",
            "Slice of Life",
            "Female Yandere",
            "Straight"
        ],
        "id": "9190460a"
    },
    {
        "title": "My Harem Grew So Large, I Was Forced to Ascend",
        "infoURL": "https://www.mangaupdates.com/series.html?id=174388",
        "description": "Original Webcomic\n\nTsundere heavenly master, big-breasted sister, barefoot poison cultivator, immortal swordswoman with white silk clothes, the last 5 out of the 6 strongest people in the world. I, Ye Gulou have become the first person to cultivate immortality through pure unbounded Yang. But wait, cultivating pure unbounded Yang means I can't form relationships with women or else I'll die?! Then what can I do about this harem of mine that's grown so large over the years? They're all chasing me down, coercing me to choose between them (otherwise they'll kill Me). They've forced me to ascend to the Heavens, to immortality right now to escape from their wrath. Oh shit, they followed me to the new world?!! Let's see what awaits us as my harems from both worlds combine!\n\n",
        "year": "2020",
        "authors": [
            "LI Zhiheng"
        ],
        "tags": [
            "Action",
            "Adventure",
            "Comedy",
            "Ecchi",
            "Fantasy",
            "Harem",
            "Romance",
            "Shounen",
            "Female Yandere",
            "Straight"
        ],
        "id": "9ce77d75"
    },
    {
        "title": "My Wife Is A Fox Spirit",
        "infoURL": "https://www.mangaupdates.com/series.html?id=162075",
        "description": "From BiliBili Comics:\nWhat does this pretty girl want with me? To marry me? That won't do... What about this pretty lady? You wanna marry me too? Tsk tsk, since when did I become so in demand?\n\nFrom ZTS:\nWhat are you doing about this beauty? Promise yourself? Can't make it ... What about this girl? Want to marry me? Alas, when did I become so popular! ?\n\nOriginal Webcomic\nOfficial English Translation\nOfficial Korean Translation (Kakaopage)\nOfficial Korean Translation (Bomtoon)\n",
        "year": "2020",
        "authors": ["You ma Manhua"],
        "tags": [
            "Comedy",
            "Romance",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "5db1a653"
    },
    {
        "title": "My Yandere Girlfriend Won’t Let Me Sleep",
        "infoURL": "https://www.mangaupdates.com/series.html?id=172634",
        "description": "Rei's girlfriend has summoned him back to the living.\n",
        "year": "2020",
        "authors": [
            "Kusunoki"
        ],
        "tags": [
            "Comedy",
            "Drama",
            "Romance",
            "Shounen",
            "Female Yandere",
            "Straight"
        ],
        "id": "12057a1d"
    },
    {
        "title": "Negai o Kanaete Moraou to Akuma o Shoukan Shita Kedo, Kawaikatta node Kekkon Shimashita - Akuma no Niidzuma",
        "infoURL": "https://www.mangaupdates.com/series/139yqw6/negai-o-kanaete-moraou-to-akuma-o-shoukan-shita-kedo-kawaikatta-node-kekkon-shimashita-akuma-no-niidzuma",
        "description": "The young orphaned adventurer, Theo Asper tried summoning the devil to help his career as his own skills are lacking. The devil comes in the form of a beauty who offers to grant him one wish. He’s so enamored with her appearance that he just falls in love at first sight. He says the first thing that comes to mind, to become his wife. She blushingly agrees to his surprising demand and they go on to future adventures together.\n",
        "year": "2020",
        "authors": [
            "Shiryu",
            "TONARI Keru"
        ],
        "tags": [
            "Comedy",
            "Ecchi",
            "Fantasy",
            "Romance",
            "Shotacon",
            "Shounen",
            "Female Yandere",
            "Straight"
        ],
        "id": "80aee066"
    },
    {
        "title": "Nageki no Bourei wa Intai Shitai - Saijiyaku Hanta ni Yoru Saikiyou Patei Ikusei Jutsu",
        "infoURL": "https://www.mangaupdates.com/series.html?id=153958",
        "description": "The golden age of treasure hunters who seek wealth, honor, power and glory, and explore treasures around the world without regard to danger.\n\n\"Let's become a treasure hunter,\" said Cri Andrich, who pledged to become a childhood friend and the strongest hero, but he had no talent.\n\nHowever, the assessment of the environment is somehow high for some reason, and only expectations are jumping every day.\n\nEvery time a distant friend of the human race goes into fury, climbing is an ability to sit on the ground!\n",
        "year": "2019",
        "authors": [
            "Tsukikage",
            "HEBINO Rai"
        ],
        "tags": [
            "Action",
            "Adventure",
            "Comedy",
            "Fantasy",
            "Harem",
            "Romance",
            "Seinen",
            "Female Yandere",
            "Straight"
        ],
        "id": "da601f03"
    },
    {
        "title": "Namae no nai Kaibutsu: Kumo to Shoujo to Ryouki Satsujin",
        "infoURL": "https://www.mangaupdates.com/series.html?id=150578",
        "description": "Midnight. Awakened by the echoing sound in my room, I was met with a frightening pair of \"legs.\" Since then, as if wishing to merely make its presence known, it remained in my room without letting itself be seen. In the same way it was spreading its encircling net, little by little it encroached on my life until at last it appeared before me. Its true form was that of an exceedingly beautiful \"nameless monster.\" Desperate resistance was futile as the monster dropped its hand towards me. I could not escape or resist. Hiding it from my skeptical lover and friends, thus opened the curtain to our strange life together. Quietly, the senses I had as a human were dying as my normal life continued to collapse. The moment I knew what was awaiting me, I was presented with an important decision.\n\nAt the same time the monster first appeared before me, the public was disturbed by a string of bizarre murders. It was then that I began to wonder whether they and my beautiful yet eerie roommate were connected.\n\n",
        "year": "2018",
        "authors": [
            "KUROKI Kyouya",
            "BANJOU Azusa",
            "Nezuki Kou"
        ],
        "tags": [
            "Drama",
            "Horror",
            "Mature",
            "Mystery",
            "Romance",
            "Sci-fi",
            "Seinen",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "59d26c33"
    },
    {
        "title": "Nanai Sanami ga kiratte Kurenai",
        "infoURL": "https://www.mangaupdates.com/series.html?id=128147",
        "description": "Inasaki Komi is a popular highschooler, but what he did not expect was that someone like Sanami Nanai would like him. Although the girl is beautiful and a great student, she has a sinister aura around her. Now Inasaki just wants to find a way to get rid of Sanami, and it appears the best way to do this is to make her hate him.\n",
        "year": "2015",
        "authors": [
            "Relucy"
        ],
        "tags": [
            "Comedy",
            "Ecchi",
            "Romance",
            "School Life",
            "Shounen",
            "Female Yandere",
            "Straight"
        ],
        "id": "a3f9f5f3"
    },
    {
        "title": "Narikawari",
        "infoURL": "https://www.mangaupdates.com/series.html?id=147305",
        "description": "Mario Ando, is feeling a total failure, being treated as invisible at home and at school is unable to build the courage to help his best friend who was constantly being bullied and eventually tries to commit suicide!  However, one day, a bracelet arrives claiming that he could now \"possess another person\" with the use of a special sticker! If he could become \"someone\" everything he desired would come true!\n",
        "year": "2018",
        "authors": [
            "OSADA Tohiki",
            "OOISHI Hiroto"
        ],
        "tags": [
            "Drama",
            "Mature",
            "Mystery",
            "School Life",
            "Shounen",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "1e495fc1"
    },
    {
        "title": "Nejimaki Kagyu",
        "infoURL": "https://www.mangaupdates.com/series.html?id=63542",
        "description": "Negizawa Kamo once tearfully promised his weak childhood friend Kagyu Jubei that he would grow up to be a teacher who would not stand for bullying. Several years later, as a teacher, he meets Kagyu once more under strange circumstances to say the least.\n\nWhile Negizawa was training to become a great teacher, Kagyu (who, like most women, fell for Negizawa) polished her fists so that she could protect him when they met again.\n\nHilarity ensues as Negizawa strives to become the teacher he once dreamed of being and Kagyu protects his chastity from the numerous women who lust after his sweet behind.\n",
        "year": "2011",
        "authors": [
            "NAKAYAMA Atsushi"
        ],
        "tags": [
            "Action",
            "Comedy",
            "Ecchi",
            "Harem",
            "Romance",
            "School Life",
            "Seinen",
            "Female Yandere",
            "Straight"
        ],
        "id": "6397ae8e"
    },
    {
        "title": "Never-Ending Darling",
        "infoURL": "https://www.mangaupdates.com/series/176v1n3/never-ending-darling",
        "description": "Ha-im Yun lives in a world where people register their DNA into cloning databases, a world where human suffering has basically been eradicated. The brilliant mind behind this cloning technology is none other than Ha-im’s boyfriend of five years, Geunhu Ji. Their relationship isn’t perfect, but they make it work -- or so Ha-im thinks, until she finds a dead body at her boyfriend’s house… and the dead body is hers. The next day, she wakes up with no recollection of the previous day until she finds a note from herself in her room… “Ha-im, if you’re reading this, you’re a clone.\n\nOriginal Webtoon:\nNaver Webtoon, Naver Series\n\nOfficial Translations:\n English, S.Chinese, Indonesian\n Japanese\n\n",
        "year": "2021",
        "authors": [
            "Woollee"
        ],
        "tags": [
            "Drama",
            "Fantasy",
            "Horror",
            "Josei",
            "Psychological",
            "Romance",
            "Sci-fi",
            "Supernatural",
            "Male Yandere",
            "Straight"
        ],
        "id": "8568d8f9"
    },
    {
        "title": "NHK ni Youkoso",
        "infoURL": "https://www.mangaupdates.com/series.html?id=188",
        "description": "From Tokyopop:\nSato Tatsuhiro is a drug-addled \"hikikomori\" (a Japanese shut-in) who thinks a sinister organization, NHK (Nihon Hikikomori Kyoukai), is the cause of all his problems! He falls in love with a girl, Misaki, who he thinks is trying to assassinate him, but doesn't know how to talk to her or if he can trust her. The more he stays in his house watching anime porn, reading manga, and doing drugs, the harder it is for him to leave. Only Misaki can keep him from rotting away in his own apartment!\n",
        "year": "2004",
        "authors": [
            "TAKIMOTO Tatsuhiko",
            "Ooiwa Kenji"
        ],
        "tags": [
            "Comedy",
            "Drama",
            "Mature",
            "Psychological",
            "Romance",
            "Shounen",
            "Slice of Life",
            "Female Yandere",
            "Straight"
        ],
        "id": "b987c525"
    },
    {
        "title": "Omoi ga Omoi Omoi-san",
        "infoURL": "https://www.mangaupdates.com/series.html?id=156644",
        "description": "Karuizawa Ryo is a third-year middle schooler who has a crush on a cute, smart, and popular girl named Omoi Miton. After hearing that Omoi is going to an all-girls high school, Karuizawa decides to confess his feelings to her. To his surprise, she agrees to date him! But... now what? Meanwhile, Omoi has everything planned from the get-go, including transferring to his high school, getting married in two years, and setting up insane rules for their relationship. Because of that, Karuizawa realizes what kind of a person Omoi truly is; a girl with an overwhelming obsession with relationships! Despite his concerns, their dating life begins, painting his high school life in a totally different color.\n\nOfficial Translation: \nComikey (English)\n\n",
        "year": "2018",
        "authors": [
            "YANO Toshitaka"
        ],
        "tags": [
            "Comedy",
            "Romance",
            "Seinen",
            "Female Yandere",
            "Straight"
        ],
        "id": "7a8c8d7e"
    },
    {
        "title": "Oniichan☆Control",
        "infoURL": "https://www.mangaupdates.com/series.html?id=42379",
        "description": "Hirose Goushi has a huge sister complex.  So huge, he moves from his home town to Tokyo to attend Myouzen University in order to escape it!\nThree years later, Goushi's little sister Noa shows up and informs him that she's taking the Myouzen University entrance exam and that she will be moving in if she passed.  Little does Goushi know, she has a similarly large (if not larger) brother complex.\n",
        "year": "2009",
        "authors": [
            "KAGESAKI Yuna"
        ],
        "tags": [
            "Comedy",
            "Ecchi",
            "Mature",
            "Romance",
            "School Life",
            "Seinen",
            "Slice of Life",
            "Female Yandere",
            "Straight",
            "Incest"
        ],
        "id": "aee534b2"
    },
    {
        "title": "Ore no Genjitsu wa Ren'ai Game?? - ka to Omottara Inochigake no Game datta",
        "infoURL": "https://www.mangaupdates.com/series.html?id=144731",
        "description": "One day, 25-year-old Hasegawa Ryou wakes up to see a holographic screen floating in front of him. The screen prompts him to save/load files and an item shop, as well as his stats. It seems like he’s been sucked into some erotic love game, since his stats depend on seducing women and “capturing” them. \nAfter finding a target and going through game-like options, Ryou thinks he knows what he has to do to “capture” his target. Surely he needs to have sex with her, right? And yet when the woman turns out to be a murderer, Ryou finds out the shocking truth: he has to capture these women and unveil their secrets! And if he fails, he dies...\n\n",
        "year": "2017",
        "authors": [
            "Waruiotoko",
            "Nashyu",
            "PONJEA"
        ],
        "tags": [
            "Action",
            "Adult",
            "Harem",
            "Mature",
            "Mystery",
            "Seinen",
            "Supernatural",
            "Tragedy",
            "Female Yandere",
            "Straight"
        ],
        "id": "3c41996f"
    },
    {
        "title": "Oshi ga Kounin Stalker ni narimashita",
        "infoURL": "https://www.mangaupdates.com/series.html?id=163412",
        "description": "Romantic comedy with well-selling idol and idol otaku!\n\nRooting for the super popular idol Moco Nanami is the reason for living for 17-year-old idol otaku Sora Amano. Lately, he's been worried because his belongings have been going missing.\n\nIn the middle of this, Sora pursued and caught a suspicious person that was running away with his smartphone - but the identity of this person - is his favorite idol Moco Nanami!?!!?\n",
        "year": "2019",
        "authors": [
            "SEO Minosuke"
        ],
        "tags": [
            "Comedy",
            "Drama",
            "Romance",
            "Seinen",
            "Slice of Life",
            "Female Yandere",
            "Straight"
        ],
        "id": "7b92fbd6"
    },
    {
        "title": "Otome no harawata hoshi no iro",
        "infoURL": "https://www.mangaupdates.com/series.html?id=153287",
        "description": "20 years ago, Weve Aliens arrived on Earth to search for marriage partners. Weve are perverted and love interbreeding. With their advanced technology, they have solved all the Earth's problems to do with the environment, food, and resources. Gen is a student at the prestigious Human-Weve school Shinryou Academy. Due to his late grandfather's words, he loathes Weve and believes that pure humans will eventually die out if something isn't done about Weves soon. However, Gen meets the Weve girl Mirika, who falls in love with him.\n",
        "year": "2018",
        "authors": [
            "ISHITO Yuhra"
        ],
        "tags": [
            "Adult",
            "Comedy",
            "Ecchi",
            "Harem",
            "School Life",
            "Sci-fi",
            "Shounen",
            "Female Yandere",
            "Straight",
            "NSFW"
        ],
        "id": "55cb60ee"
    },
    {
        "title": "Oujougiwa no Imi o Shire!",
        "infoURL": "https://www.mangaupdates.com/series.html?id=163119",
        "description": "Ichimatsu Kairo's ex-girlfriend, Kusakabe Hiyori, who disappeared 7 years ago appears before him again one day. As someone who was converted into a devout follower of the Hiyori religion, he became unable to live in reality when she left. Reunited, she divulges to him her unreasonable demand, \"Ichimatsu-kun, I want my childbirth recorded so give me your sperm.\"\n",
        "year": "2020",
        "authors": [
            "YONESHIRO Kyou"
        ],
        "tags": [
            "Comedy",
            "Drama",
            "Psychological",
            "Romance",
            "Seinen",
            "Slice of Life",
            "Male Yandere",
            "Straight"
        ],
        "id": "49561943"
    },
    {
        "title": "Oukoku Game",
        "infoURL": "https://www.mangaupdates.com/series.html?id=95782",
        "description": "At the end of Meiji Restoration, a girl saint was crucified and burnt alive under persecution.\n\nA century later, Katori and six childhood friends are summoned to her world beyond the nirvana, where they receive the Great Commission: Build a kingdom, and make disciples of all nations.\n\nAt every midnight, each of them are randomly given a role out of King/Queen, Noble, and Peasants. As the lowly must obey a higher-up in the hierarchy, can they fight and defeat other nations to conquer the world--before infighting brought up by their own hidden desires breaks them apart?\n",
        "year": "2013",
        "authors": [
            "SORASE Haruyuki"
        ],
        "tags": [
            "Drama",
            "Ecchi",
            "Fantasy",
            "Horror",
            "Mystery",
            "Psychological",
            "Shounen",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "8e97ee0d"
    },
    {
        "title": "Overbearing Yandere Demonic Sword",
        "infoURL": "https://mangadex.org/title/1d8fd3f8-702c-4086-aa53-68981c6045bf/",
        "description": "Do not cheat on your knaifu waifu if you value keeping your laifu.",
        "year": "2022",
        "authors": [
            "Kuga Tsuniya"
        ],
        "tags": [
            "Demons",
            "Romance",
            "Comedy",
            "Horror",
            "Fantasy",
            "Web Comic",
            "Full Color",
            "Female Yandere",
            "Straight"
        ],
        "id": "33e0498c"
    },
    {
        "title": "Persona 3 dj - Ikimonogoroshi",
        "infoURL": "https://www.mangaupdates.com/series.html?id=109368",
        "description": "Persona 3 doujinshi, by Dowman Sayman (thetsuuyaku)\n\nAigis\n",
        "year": "2014",
        "authors": [
            "DOUMAN Seiman"
        ],
        "tags": [
            "Doujinshi",
            "Drama",
            "Mature",
            "Psychological",
            "Tragedy",
            "Female Yandere",
            "Straight"
        ],
        "id": "509cbdc1"
    },
    {
        "title": "Peter Grill to Kenja no Jikan",
        "infoURL": "https://www.mangaupdates.com/series.html?id=144835",
        "description": "Upon winning a fighting tournament and being crowned the world’s strongest warrior, Peter Grill discovers a downside to his newfound fame. Women of all species, from ogres to elves, are scrambling over each other for his seed to ensure they have the strongest babies possible. Poor Peter just wants to settle down with his lovey dovey fiancée, but he’ll have to outmatch, outwit, and outrun a harem of very determined monster girls to do so!\n",
        "year": "2017",
        "authors": [
            "HIYAMA Daisuke"
        ],
        "tags": [
            "Comedy",
            "Ecchi",
            "Fantasy",
            "Harem",
            "Mature",
            "Romance",
            "Seinen",
            "Female Yandere",
            "Straight"
        ],
        "id": "71cf0614"
    },
    {
        "title": "Pulseless Girlfriend",
        "infoURL": "https://www.mangaupdates.com/series.html?id=153540",
        "description": "When Makoto accidentally caused a girl to fall from three stories on to the ground below he thought his life was over. However, can he handle the 'heavy' responsibility of his action.\n",
        "year": "2019",
        "authors": [
            "Gorugomu"
        ],
        "tags": [
            "Romance",
            "School Life",
            "Seinen",
            "Supernatural",
            "Female Yandere",
            "Straight",
            "Harem"
        ],
        "id": "156cdfe9"
    },
    {
        "title": "Raise wa Tanin ga Ii",
        "infoURL": "https://www.mangaupdates.com/series.html?id=144351",
        "description": "Yoshino grew up as the yakuza princess of the Osaka Somei crime family. Everyone left her alone due to her sharp gaze and mobster ties. But when her grandfather signs a truce with the Tokyo-based Miyama crime family, she’s offered for betrothal to the Miyama leader’s grandson, Kirishima. At first, Kirishima seems amiable and polite–but when he shows his dark side, he proves to be more disturbing than any gangster Yoshino has ever met. This engagement is sure to be a wild ride for a tough yakuza princess and her twisted yakuza prince!\n\nNote: Won first place at the Tsugi ni Kuru Manga Taishou 2018 awards. Was nominated for the 46th Annual Kodansha Manga Awards (best General Manga Series).\n\n",
        "year": "2017",
        "authors": [
            "KONISHI Asuka"
        ],
        "tags": [
            "Drama",
            "Mature",
            "Psychological",
            "Romance",
            "School Life",
            "Seinen",
            "Male Yandere",
            "Straight"
        ],
        "id": "2cb4c3cc"
    },
    {
        "title": "Re:Birth - The Lunatic Taker",
        "infoURL": "https://www.mangaupdates.com/series.html?id=44570",
        "description": "In the hometown of high school student Tachibana Reiji there has been an unusual string of suicides lately. Some people believe that this string of suicides might have something to do with the urban myth of \"death accessories\", which are magical objects that cause people to die soon after they pick them up.\n\nReiji, who lives alone with his adoring older sister Ayaka, doesn't believe this kind of nonsense, so he has no problem picking up a strange bracelet he finds on the street. Almost immediately, he finds himself forced to form a \"contract\" with his new bracelet. Now, in order to remain alive, Reiji must use the power of his bracelet to fight and kill others like him! His only ally in this new life is his sister Ayaka, who is determined to protect her little brother at any cost!\n\n",
        "year": "2009",
        "authors": [
            "LIM Dall-Young",
            "Lee Soo Hyon"
        ],
        "tags": [
            "Action",
            "Drama",
            "Ecchi",
            "Mature",
            "Romance",
            "School Life",
            "Seinen",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "cb538532"
    },
    {
        "title": "Regressor Instruction Manual",
        "infoURL": "https://www.mangaupdates.com/series.html?id=190936",
        "description": "[Will you join the game?] Giyoung's suddenly thrown into a game of life and death. Not only that but he's also the player with the lowest stats. Still, he's got one skill on his side: the ability to read other players' status! He finds the opportunity of his life when he discovers that Hyunsung is a returner to this world. Now all Giyoung has to do is stick next to Hyunsung and game his way out of this tutorial.\n\nOriginal Novel:\nNaver Series, KakaoPage, Ridibooks, Joara, MrBlue, English\n\nOriginal Webtoon:\nKakaoPage, Daum\n\nOfficial Translations: \nEnglish, Japanese, German, S.Chinese, Thai, Indonesian, French, T.Chinese\n\n",
        "year": "2021",
        "authors": [
            "Domi",
            "wooden spoon",
            "MIDNIGHT STUDIO"
        ],
        "tags": [
            "Action",
            "Comedy",
            "Drama",
            "Fantasy",
            "Shounen",
            "Female Yandere",
            "Straight",
            "Harem"
        ],
        "id": "f468204d"
    },
    {
        "title": "Renai Boukun",
        "infoURL": "https://www.mangaupdates.com/series.html?id=81992",
        "description": "A Kiss Note is a powerful notebook that makes anyone who has their name written together will instantly fall in love if they kiss each other regardless of any circumstances. This magical and very familiar item belongs to an angel named Guri whose job as cupid is to create couples. However, she accidentally writes down Aino Seiji, a regular high school student, and unless he kisses someone, Guri will die. She convinces Seiji to go kiss his crush, Hiyama Akane, the school's popular girl who turns out has even stronger feelings for him, bordering on obsessive and psychotic. Eventually Akane and Seiji come together but not before Guri decides that she likes Seiji as well. What seems awesome to most guys becomes hell for Seiji who just wants a normal relationship with girls.\n\n",
        "year": "2012",
        "authors": [
            "MIHOSHI Megane"
        ],
        "tags": [
            "Comedy",
            "Ecchi",
            "Harem",
            "Romance",
            "School Life",
            "Seinen",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "2adaeada"
    },
    {
        "title": "Sachi-iro no One Room",
        "infoURL": "https://www.mangaupdates.com/series.html?id=140131",
        "description": "One day, a fourteen year-old girl was kidnapped... or so the police have been lead to believe. Actually, she tried to run away from her abusive parents and was helped by her stalker who then shelters her in his apartment. Although he considers his actions as kidnapping, the girl is happy about the situation and proposes to him, with the condition that if they are caught, they will commit suicide.\n\nOriginal Webcomic\nOfficial English\n",
        "year": "2016",
        "authors": [
            "Hakuri"
        ],
        "tags": [
            "Drama",
            "Mature",
            "Mystery",
            "Psychological",
            "Tragedy",
            "Male Yandere",
            "Straight"
        ],
        "id": "6794f050"
    },
    {
        "title": "Saikyou Juzoku Tensei: Majutsu Otaku no Utopia",
        "infoURL": "https://www.mangaupdates.com/series.html?id=151456",
        "description": "A magic-obsessed highschooler was hit by a truck and born again in another world. Now he lives as Abel Belek, born in a tribe of magic users called the Marren Clan. With his interest in magic from his previous life, he spent his days studying magic under the tutelage of the village's Chief, displaying high capacity for magic, amazing everyone young and adults, and declaring this world to be his paradise.\n\nBut, once he reached the age of 16, his father told him that he was to be married, in accordance with the traditions of the clan, to his clingy little sister!!\n\nNot wanting to comply to his family expectations and crossing forbidden lines, he decides to flee to the city, against the traditions and laws of the village. And then the story really starts.\n\n",
        "year": "2018",
        "authors": [
            "Necoco",
            "SHINOMURA Asahi"
        ],
        "tags": [
            "Adventure",
            "Comedy",
            "Fantasy",
            "Harem",
            "Romance",
            "Shounen",
            "Female Yandere",
            "Straight",
            "Incest"
        ],
        "id": "ec3e433a"
    },
    {
        "title": "Saitama Chainsaw Shoujo",
        "infoURL": "https://www.mangaupdates.com/series.html?id=31393",
        "description": "From Horobi no Michi:\n\nKirisaki Fumio's just a highschool girl in love...\n\n...but then she finds out that the guy she's fallen for happens to love someone else.\n\n...so she decides to go out and get a chainsaw.\n\nAnd take it to school.\n\nAnd then many things happen.\n",
        "year": "2008",
        "authors": [
            "SAKURAZAKA Hiroshi",
            "UGUISU Kagura"
        ],
        "tags": [
            "Action",
            "Comedy",
            "Drama",
            "Psychological",
            "School Life",
            "Shounen",
            "Female Yandere",
            "Straight"
        ],
        "id": "0ebf4546"
    },
    {
        "title": "Satou-kun wa Mite iru.",
        "infoURL": "https://www.mangaupdates.com/series.html?id=153014",
        "description": "Satou Kazuya is a 30-year-old office worker and a virgin. His daily routine is Playing Eroge while Masturbating. One night he got the \"Peeping Application\" from God, It was not an ordinary application but an application that could read a woman's heart.\n",
        "year": "2018",
        "authors": [
            "Yukino"
        ],
        "tags": [
            "Adult",
            "Comedy",
            "Harem",
            "Seinen",
            "Supernatural",
            "Female Yandere",
            "Straight",
            "NSFW"
        ],
        "id": "9f770696"
    },
    {
        "title": "Secret Alliance",
        "infoURL": "https://www.mangaupdates.com/series.html?id=156164",
        "description": "From Lezhin:\nEun Sian, otherwise known as Shanshan by her good friend Hyunee, is popular with all the girls at school. Which would be great if she swung that way, but she doesn’t. It just happens that she’s terrified of men, and her mother is obsessed with protecting her from all men. And suddenly, Yuri, the prettiest girl at school, has admitted to Sian that she has feelings for her. Now Yuri won’t stop following Sian around, which would also be fine by Sian, except it seems like Yuri wants Sian all to herself... and who knows how far she’ll go to make sure that happens.\n\nOriginal Webtoon\nOfficial English\nOfficial Japanese\nOfficial French\n\n",
        "year": "2019",
        "authors": [
            "Lero"
        ],
        "tags": [
            "Drama",
            "Gender Bender",
            "Josei",
            "Mystery",
            "Psychological",
            "Romance",
            "Male Yandere",
            "Straight"
        ],
        "id": "bdcf0af1"
    },
    {
        "title": "Seishun Pop!",
        "infoURL": "https://www.mangaupdates.com/series.html?id=41979",
        "description": "Every day Sakuta Gotou likes to zone out to his favorite band, Incest, because it makes him feel at ease.  However, this band is very secretive and has yet to have a live performance.  Now, when the chance comes to Gotou to see his idol Iive, the band's singer, on stage, he finds out that she is the new transfer student in the classroom next door... and to make this even better she stops the concert and grabs him saying, \"I've wanted to see you.\"  What is he going to do now?\n",
        "year": "2009",
        "authors": [
            "KITAKAWA Touta"
        ],
        "tags": [
            "Adult",
            "Drama",
            "Psychological",
            "Romance",
            "School Life",
            "Seinen",
            "Female Yandere",
            "Straight"
        ],
        "id": "9010dc1e"
    },
    {
        "title": "She will Die in 100 Days",
        "infoURL": "https://mangadex.org/title/3318b81b-bd45-4fa1-b967-d5dcea04eade/",
        "description": "A yandere who will inevitably kill a girl after 100 days.",
        "year": "2020",
        "authors": [
            "Creek Neo"
        ],
        "tags": [
            "4 Koma",
            "Web Comic",
            "Slice Of Life",
            "Female Yandere",
            "Straight",
            "Harem"
        ],
        "id": "51928fe8"
    },
    {
        "title": "Shimoneta to Iu Gainen ga Sonzai Shinai Taikutsu na Sekai: Man**-hen",
        "infoURL": "https://www.mangaupdates.com/series.html?id=109049",
        "description": "Set 16 years after the \"Law for Public Order and Morals in Healthy Child-Raising\" banned coarse language in the country. Tanukichi Okuma enrolls in the country's leading elite public morals school and is soon invited into the Anti-Societal Organization (SOX) by its founder, Ayame Kajō. As a member blackmailed into joining by Ayame, Tanukichi ends up taking part in obscene acts of terrorism against the talented student council president Anna (for whom Tanukichi has a crush).\n",
        "year": "2014",
        "authors": [
            "AKAGI Hirotaka",
            "Yuzuki N'"
        ],
        "tags": [
            "Comedy",
            "Ecchi",
            "Harem",
            "Mature",
            "Romance",
            "School Life",
            "Shounen",
            "Female Yandere",
            "Straight"
        ],
        "id": "90294058"
    },
    {
        "title": "Shinigami-sama to 4-nin no Kanojo",
        "infoURL": "https://www.mangaupdates.com/series.html?id=98567",
        "description": "From tethysdust at MangaHelpers:\n\nMinaguchi Kaoru is nothing special. He's no good at sports or school, isn't in any clubs, and he's not popular. He has no friends and isn't even interested in any of the girls he knows. He's also teased due to the fact that he loves shoujo manga. Unlike the harem daydreams of his peers, he dreams of finding his true love. Unfortunately, a shinigami comes to kill him, simply because he's a \"forever alone\" sort of guy. When he gasps out his intention of embracing life with his final breaths, though, she takes it back! As long as he follows through on his intentions, he won't be killed. \n\nTo convince the shinigami that his plans are genuine, he declares that he will confess to the girl he likes, the very next day. Expecting failure with confessing to random girls in his school, he sends out love letters to four different girls. To his surprise, they all agree to be his girlfriend. Now, this shoujo-manga-loving guy has ended up in a kind of harem story, quadruple-timing four girls! Will he be able to stay involved enough with society to avoid an early death?\n\n",
        "year": "2013",
        "authors": [
            "SUYAMA Shin",
            "CHuN"
        ],
        "tags": [
            "Comedy",
            "Harem",
            "Romance",
            "School Life",
            "Shounen",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "1cda5a8a"
    },
    {
        "title": "Shounen no Abyss",
        "infoURL": "https://www.mangaupdates.com/series.html?id=163156",
        "description": "In a town with nothing, in the middle of daily life with seemingly no signs of change, high schooler Reiji Kurose was \"just\" living. Family, dreams for the future and childhood friends. All of them were binding him down to that city. He thought he would \"just\" keep on living like that. Until he met her. Is there hope in living? Is there light waiting ahead? It's the start of a boy meets girl series which reflects the \"now\".\n",
        "year": "2020",
        "authors": [
            "MINENAMI Ryou"
        ],
        "tags": [
            "Adult",
            "Drama",
            "Psychological",
            "Romance",
            "School Life",
            "Seinen",
            "Tragedy",
            "Female Yandere",
            "Straight"
        ],
        "id": "8e9f756a"
    },
    {
        "title": "Shuuen no Shiori",
        "infoURL": "https://www.mangaupdates.com/series.html?id=88278",
        "description": "A story based off of the \"Shuuen no Shiori Project\", a song series by 150P and Suzumu. The stories are based off of Japanese children's games and urban legends such as one-man hide and seek, doppelgangers, mearry's phone and monkey paw.\n\nOn the normal, unchanging campus, it suddenly occurred; A murder case where a body was cut open, right into two. On the other side of the unsolved case, the rumor-loving high school students became involved in a certain ritual. From the extremely popular songs on Nico Nico Douga, begins the Project.\n\nWhat is the “Bookmark of Demise”…? \nWho is the traitor…? \nWhat will the conclusion to this story be…?\n\nSo, can you solve this mystery?\n\n",
        "year": "2012",
        "authors": [
            "Suzumu",
            "YUKI Amino"
        ],
        "tags": [
            "Horror",
            "Mystery",
            "School Life",
            "Shoujo",
            "Supernatural",
            "Male Yandere",
            "Female Yandere",
            "Lesbian",
            "Gay"
        ],
        "id": "9d075bf7"
    },
    {
        "title": "Sister Blood",
        "infoURL": "https://www.mangaupdates.com/series.html?id=114649",
        "description": "Shou, the older brother, and Saya, the little sister, only have each other. The two of them lived happily, enjoying their peaceful lives together. That is, until Saya was bitten.\n\nWhen bitten by a pure-blooded vampire, the one who was bitten may themself become a vampire, as was the case with Saya. She can't leave the house out of fear that she will feast, and her brother must lock her away to protect her from vampire hunters, such as himself. The only solace she has is being taken care of by her beloved older brother, whom she knows has eyes only for her, and vice-versa.\n\nAnd so, Shou has made it his goal to kill the pure-blooded vampire who bit his sister, believing that in doing so he may restore his sister to what she once was, and becomes an expert for that. But since Saya was bitten, she has become increasingly obsessed and forceful. She can't stand being mere siblings anymore, and Shou is having a hard time holding back.\n\nWill Shou give in? Or will he kill the pure-blooded vampire first? And even if he does, will that be enough to stop the romance forming between the two of them?\n\n",
        "year": "2014",
        "authors": [
            "MATRA Milan"
        ],
        "tags": [
            "Action",
            "Drama",
            "Ecchi",
            "Harem",
            "Horror",
            "Mature",
            "Mystery",
            "Romance",
            "Supernatural",
            "Female Yandere",
            "Straight",
            "Incest"
        ],
        "id": "2d9f66f7"
    },
    {
        "title": "Stalker x Stalker",
        "infoURL": "https://www.webtoons.com/en/challenge/stalker-x-stalker/list?title_no=245662",
        "description": "What happens when two yandere stalkers fall in love with each other? ART: PrincessHinghoi - STORY: Merryweather",
        "year": "2018",
        "authors": ["PrincessHinghoi", "Merryweather"],
        "tags": [
            "Male Yandere",
            "Female Yandere",
            "Straight"
        ],
        "id": "7977433a"
    },
    {
        "title": "Suki x Suki (HIBARU Shunsuke)",
        "infoURL": "https://www.mangaupdates.com/series.html?id=133013",
        "description": "Touka Aizuki is girl who can turn invisible and no one can see her except for one person, Ryoutarou Mimori. \nEven though she is physically invisible, her love is completely visible!\n",
        "year": "2015",
        "authors": [
            "HIBARU Shunsuke"
        ],
        "tags": [
            "Comedy",
            "Romance",
            "School Life",
            "Shounen",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "7b3f22da"
    },
    {
        "title": "Sultan's Love",
        "infoURL": "https://www.mangaupdates.com/series.html?id=172341",
        "description": "For eleven years, Sayeh has resided in the sultan’s harem, staying out of sight and doing her best to avoid attracting any attention. All that changes when one night, she happens across the sultan’s path and is called to his bedchamber… But just when all seems lost for Sayeh, news of a sudden revolt by the ninth prince, Kainer, rocks the palace. Under Kainer’s rule, all the other women are set free from the harem, and Sayeh hopes that her freedom may finally be within reach as well. Instead, the newly crowned sultan pays her a personal visit, expressing feelings for Sayeh that she never could've imagined. But does Kainer’s love offer her salvation or ruin…?\n\nOriginal Webtoon:\n•Marture:\nRidibooks, Lezhin, Naver Series, Bomtoon, Comico\n•All-Age:\nRidibooks, Lezhin, Naver Series, Comico\n\nOfficial Translations:\nEnglish, S.Chinese, German, T.Chinese, Japanese, Thai\n\n\"Even if no one believes in me, you must, Miss Saye. I am a man who has decided to become the Sultan because you are a woman that belongs to the Sultan.\"\n\nSaye, who was a young flower who had not been picked in the Sultan's harem, survives the crisis of the 9th Prince, Kainer, who is the son of the previous Sultan, starting a rebellion. Saye, who struggled to even keep herself alive, only wishes to escape the harem and step out into the world. But Kainer, who has become the Sultan, has no intention of letting her go, and shocks her by telling her that she was the only reason he had become the Sultan.\n\n",
        "year": "2020",
        "authors": [
            "Chyom Chyom",
            "Ggong"
        ],
        "tags": [
            "Josei",
            "Romance",
            "Smut",
            "Male Yandere",
            "Straight",
            "NSFW"
        ],
        "id": "172bd134"
    },
    {
        "title": "Tanaka The Wizard",
        "infoURL": "https://www.mangaupdates.com/series.html?id=140710",
        "description": "Yoshio Tanaka gets reincarnated into a fantasy game world, with healing magic as a \"cheat\" ability.\n",
        "year": "2016",
        "authors": [
            "Buncololi",
            "TOKITA Monta"
        ],
        "tags": [
            "Action",
            "Adult",
            "Adventure",
            "Comedy",
            "Drama",
            "Fantasy",
            "Seinen",
            "Female Yandere",
            "Straight"
        ],
        "id": "5ea43254"
    },
    {
        "title": "Tatoeba Last Dungeon Mae no Mura no Shounen ga Joban no Machi de Kurasu Youna Monogatari",
        "infoURL": "https://www.mangaupdates.com/series.html?id=144928",
        "description": "Follow the story of Loyd, an oblivious boy from a village in the countryside, who wishes to become a soldier in the capital. After convincing the mayor of his village, a loli witch, who is over a 100 years old, he sets off to the capital to fulfill his dream! \n(WhimSubs)\n",
        "year": "2017",
        "authors": [
            "SATOU Toshio (サトウとシオ)",
            "FUSEMACHI Hajime"
        ],
        "tags": [
            "Action",
            "Adventure",
            "Comedy",
            "Fantasy",
            "Shounen",
            "Female Yandere",
            "Straight"
        ],
        "id": "98fea535"
    },
    {
        "title": "Tatoe Sekai ga Owattemo, Watashi wa Kanojo wo Erabanai",
        "infoURL": "https://www.mangaupdates.com/series.html?id=168905",
        "description": "In a world coming to its end, who do you want to be loved by? As the end of the world ticks by, this is a story of two girl's trembling love, and their terrifying memories. (This is a comedy)\n",
        "year": "2020",
        "authors": [
            "FUJISAKI Roto"
        ],
        "tags": [
            "Comedy",
            "Drama",
            "Psychological",
            "Yuri",
            "Female Yandere",
            "Lesbian"
        ],
        "id": "c90c236e"
    },
    {
        "title": "Tatsumigahara-san no Ai Kara wa Nigerarenai",
        "infoURL": "https://www.mangaupdates.com/series/9rt9mba",
        "description": "At a party, Mondo, a typical college student, meets Tatsumigahara Aoi, a well-known beauty. But after having a few drinks with her, he passes out and wakes up chained in Aoi's home.\n\nEven though Aoi looks after Mondo in every way (including in explicit ways), Mondo tries to flee from her home. The outcome is uncertain.\n",
        "year": "2023",
        "authors": [
            "MAKITA Naru"
        ],
        "tags": [
            "Ecchi",
            "Harem",
            "Horror",
            "Romance",
            "Female Yandere",
            "Straight"
        ],
        "id": "3d887588"
    },
    {
        "title": "Tensei Gotoki de Nigerareru to demo, Nii-san?",
        "infoURL": "https://www.mangaupdates.com/series.html?id=173811",
        "description": "The older brother, imprisoned by his sister, dies just as he escapes and is reincarnated in another world!\nHe thought he had been freed from his demonic sister, but now she too has been reincarnated in the same world...?\n",
        "year": "2020",
        "authors": [
            "KAMISHIRO Kyousuke",
            "Yurishiro"
        ],
        "tags": [
            "Action",
            "Comedy",
            "Ecchi",
            "Fantasy",
            "Horror",
            "Romance",
            "Shounen",
            "Female Yandere",
            "Straight",
            "Incest"
        ],
        "id": "18846183"
    },
    {
        "title": "Tensei Shitara dai Nana Ouji dattanode, Kimamani Majutsu o Kiwamemasu",
        "infoURL": "https://www.mangaupdates.com/series.html?id=169082",
        "description": "A magic nerd's life came to an end after a dreadful encounter with the nobles who ended his life with a powerful spell. His last wish, being able to study and master more magic, has been answered when he was reincarnated as Lloyd de Saloom, the 7th prince of Saloom Kingdom. Now he'll be able to perfect his magic as he pleases...\n",
        "year": "2020",
        "authors": [
            "Kenkyo na Circle",
            "KOKUZAWA Yousuke"
        ],
        "tags": [
            "Action",
            "Adventure",
            "Comedy",
            "Ecchi",
            "Fantasy",
            "Harem",
            "Shounen",
            "Female Yandere",
            "Straight"
        ],
        "id": "2a98e1e3"
    },
    {
        "title": "The Advanced Player of the Tutorial Tower",
        "infoURL": "https://www.mangaupdates.com/series.html?id=166529",
        "description": "After being trapped for 12 years in a tower full of regenerating monsters, Hyeonu Kim is more powerful than just about any human or monster on Earth. Now that he’s free, he’s determined to find out who was behind his imprisonment, even if that means he has to kill hordes of monsters -- and inadvertently save the world -- along the way.\n\nOriginal Novel:\nNaver Novel, Naver Series, Yonder (English)\n\nOriginal Webtoon:\nNaver Webtoon, Naver Series\n\nOfficial Translations: \nEnglish, Japanese, Spanish, S.Chinese, Thai, Indonesian, French, German, T.Chinese\n",
        "year": "2020",
        "authors": [
            "Bangguseokgimssi",
            "Omagam"
        ],
        "tags": [
            "Action",
            "Adventure",
            "Comedy",
            "Fantasy",
            "Martial Arts",
            "Shounen",
            "Female Yandere",
            "Straight",
            "Harem"
        ],
        "id": "02a9e390"
    },
    {
        "title": "The Cool Classmate ◯◯ Years Later...",
        "infoURL": "https://www.mangaupdates.com/series/x2k0ejr/the-cool-classmate-years-later",
        "description": "",
        "year": "",
        "authors": ["Kyutai X"],
        "tags": [
            "Comedy",
            "Romance",
            "Slice of Life",
            "Female Yandere",
            "Straight"
        ],
        "id": "075aa736"
    },
    {
        "title": "The Death Game Is All That Saotome-san Has Left",
        "infoURL": "https://www.mangaupdates.com/series.html?id=186502",
        "description": "During a summer vacation with class 2-A, Makoto and his fellow classmates find themselves waking up in an unknown abandoned school building out in the woods. It turns out they’ve been captured and taken hostage by unknown people who have the intention of making two of the students participate in a “death game” where Makoto gets picked along with his classmate, Saotome. Follow along Makoto and Saotome as they unravel the truth behind the “death game”!\n\nOriginal Oneshot\n",
        "year": "2022",
        "authors": [
            "MIKAMI Yuu"
        ],
        "tags": [
            "Comedy",
            "Romance",
            "Shounen",
            "Female Yandere",
            "Straight"
        ],
        "id": "b83b0e9b"
    },
    {
        "title": "The Male Lead is a Murderer",
        "infoURL": "https://tapas.io/series/the-male-lead-is-a-murderer",
        "description": "Amber is an author desperate for a best-seller, but while trying to write a new idea, she dies in an accident. The next time she opens her eyes, she is the main character inside her own unfinished novel! High school was hell for Amber, and fictional life inside her book is worse—her novel was a thriller where the heroine is pursued by a love-obsessed psychopath! Now, Amber needs to avoid the male lead to stay alive and find a way to bring her book to an ending without losing it all.",
        "year": "2021",
        "authors": ["Nana.maruse", "Egativism"],
        "tags": [
            "Web Comic",
            "Drama",
            "Mystery",
            "Psychological",
            "Romance",
            "Male Yandere",
            "Straight"
        ],
        "id": "3f549a9f"
    },
    {
        "title": "The Melancholy of Haruhi Suzumiya dj - Curry Today, Curry Tomorrow",
        "infoURL": "https://www.mangaupdates.com/series.html?id=73674",
        "description": "A cute doujin about home-cooked meals.\n\n*Who wants curry~*\n",
        "year": "2007",
        "authors": [
            "Arikawa Satoru",
            "Nekousapurin (OOISHI Kou)"
        ],
        "tags": [
            "Doujinshi",
            "Female Yandere",
            "Straight"
        ],
        "id": "15a17eea"
    },
    {
        "title": "The Parakeet Wants to tell you",
        "infoURL": "https://mangadex.org/title/dde11e78-91ef-4065-8b44-c65ca13bb14b/the-parakeet-wants-to-tell-you",
        "description": "4-Pagers by Tatsunoko.\n\nThere's not much for Synopsis as it'll be a total spoiler.",
        "year": "2022",
        "authors": [
            "Tatsunoko"
        ],
        "tags": [
            "Romance",
            "Comedy",
            "4 Koma",
            "Female Yandere",
            "Straight"
        ],
        "id": "95af6216"
    },
    {
        "title": "The Secret of the Partner Next to You",
        "infoURL": "https://www.mangaupdates.com/series/dpvwvd0",
        "description": "Original Webtoon\n",
        "year": "2022",
        "authors": ["Chaegun"],
        "tags": [
            "Drama",
            "Mystery",
            "Romance",
            "School Life",
            "Shoujo",
            "Slice of Life",
            "Female Yandere",
            "Straight"
        ],
        "id": "2a1bcf14"
    },
    {
        "title": "The Story of Getting Dumped So Often That You Think Whatever, I'm fine with him and Genderswap Your Best Friend And Can't Undo It",
        "infoURL": "https://mangadex.org/title/c52e6d0e-e354-4c4f-b608-ebb6297acfd5/",
        "description": "- Creator-approved translations by [Hachirumi Scans.](https://twitter.com/HachirumiScans)",
        "year": "",
        "authors": [
            "Kiyu Fuyuki"
        ],
        "tags": [
            "Oneshot",
            "Genderswap",
            "Romance",
            "Web Comic",
            "Full Color",
            "Female Yandere",
            "Straight"
        ],
        "id": "ce6a61d2"
    },
    {
        "title": "The Story of When I Was Confined by an Unknown High School Girl",
        "infoURL": "https://www.mangaupdates.com/series.html?id=185805",
        "description": "Original Pixiv Series\n",
        "year": "2021",
        "authors": [
            "KITADA Ryoma"
        ],
        "tags": [
            "Comedy",
            "Drama",
            "Ecchi",
            "Mystery",
            "Psychological",
            "Romance",
            "Slice of Life",
            "Female Yandere",
            "Straight"
        ],
        "id": "7dd048d8"
    },
    {
        "title": "The Unexpected Guest",
        "infoURL": "https://www.anime-planet.com/manga/the-unexpected-guest",
        "description": "Mark is a novelist who only gets inspirations through his neighbors. One day, he welcomes a cheeky unexpected guest to his house.",
        "year": "2020",
        "authors": null,
        "tags": [
            "Drama",
            "Web Comic",
            "Full Color",
            "Ecchi",
            "Female Yandere",
            "Straight",
            "NSFW"
        ],
        "id": "489347a8"
    },
    {
        "title": "The Yandere Pet Cat is Overly Domineering",
        "infoURL": "https://mangadex.org/title/cf1e12a8-315f-4048-a9c2-c71723a13b0c/",
        "description": "",
        "year": "2022",
        "authors": [
            "Kotatsu"
        ],
        "tags": [
            "Animals",
            "Romance",
            "Web Comic",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "cdaa1058"
    },
    {
        "title": "Tokage no Ou",
        "infoURL": "https://www.mangaupdates.com/series.html?id=75381",
        "description": "Ikagawa Tokage is a boy with a superpower. He has the the ability to change the color of his eyes whenever he closes and reopens the eyes. Kinda useless, right? Regardless, Ikagawa Tokage strives to strengthen his power in an effort to become the strongest and not have his power be nothing more than an arrow to the knee. With that desire in mind, he trains daily in an abandoned building in modern day Tokyo. But on one such day, he comes to what looks to be a scene of a crime and feels the culprit might still be nearby. Will he make it out of the abandoned building with a broken knee? Is there more to his power than meets the eye?\n\n",
        "year": "2012",
        "authors": [
            "IRUMA Hitoma",
            "KAMIZUKI Shiki"
        ],
        "tags": [
            "Drama",
            "Ecchi",
            "Horror",
            "Psychological",
            "Seinen",
            "Supernatural",
            "Female Yandere",
            "Straight"
        ],
        "id": "db242791"
    },
    {
        "title": "Tonari no Idol-san",
        "infoURL": "https://www.mangaupdates.com/series.html?id=156090",
        "description": "An otaku’s idol moves right next to him. And it’s a dream come true! But as it turns out, she’s a bit more sadistic then we expected. Are you seeing a trend here? There is no mercy. Submit to the bully girl of your dreams now.\n",
        "year": "2019",
        "authors": [
            "Sekizui Hikinuki no Kei"
        ],
        "tags": [
            "Comedy",
            "Drama",
            "Psychological",
            "Romance",
            "Seinen",
            "Female Yandere",
            "Straight"
        ],
        "id": "3c74e053"
    },
    {
        "title": "Oshi no Idol ga Tonari no Heya ni Hikkoshite Kita",
        "infoURL": "https://www.mangaupdates.com/series.html?id=158087",
        "description": "An otaku’s idol moves right next to him. And it’s a dream come true! But as it turns out, she’s a bit more sadistic than expected. Are you seeing a trend here? There's no mercy. Submit to the bully girl of your dreams now. -Orchesc/a/ns\n",
        "year": "2019",
        "authors": [
            "Sekizui Hikinuki no Kei"
        ],
        "tags": [
            "Comedy",
            "Drama",
            "Psychological",
            "Romance",
            "Shounen",
            "Slice of Life",
            "Female Yandere",
            "Straight"
        ],
        "id": "c5641b65"
    },
    {
        "title": "Tonari no Seki no Hen na Senpai",
        "infoURL": "https://www.mangaupdates.com/series.html?id=165860",
        "description": "Mebuki Mayumi likes handsome guys more than breakfast, lunch, and dinner. By a great stroke of luck that can only be called fate, she is suddenly transferred to the sales department, the section where the most beauties are concentrated. \n\nSurrounded by good-looking guys every day, \"This is the beginning of paradise!\" she shouts, as she does a crazy dance in her mind. The section manager is a handsome guy with model-like proportions, who is 182 cm tall. The innocent new employee pokes at her maternal instincts, and then there's the hottie who placed 8th nationwide in tennis during his college days. \n\nTo her, it truly is the ultimate gathering spot of handsome men where all types could be seen, however, there was only one \"man\" who bothered Mayumi... \n\nAsahina Akio, the senpai sitting next to her. \n\nHe likes Mayumi, however, he's actually a disgustingly clingy, stalker-like, perverted bastard!\n\nOfficial Korean\n\n",
        "year": "2019",
        "authors": [
            "Usukuchi"
        ],
        "tags": [
            "Adult",
            "Comedy",
            "Josei",
            "Romance",
            "Slice of Life",
            "Smut",
            "Male Yandere",
            "Straight",
            "NSFW"
        ],
        "id": "d724bd96"
    },
    {
        "title": "Tonari no Uchuubito ga Kowai",
        "infoURL": "https://www.mangaupdates.com/series.html?id=182399",
        "description": "Original Pixiv Series\n\nMarunouchi-kun's new alien classmate was supposed to be a super fantastic alien, but...\n",
        "year": "2021",
        "authors": [
            "ATOU Rie"
        ],
        "tags": [
            "Comedy",
            "Fantasy",
            "Romance",
            "School Life",
            "Shounen",
            "Female Yandere",
            "Straight"
        ],
        "id": "546832d4"
    },
    {
        "title": "Touhou dj - Yami-mari",
        "infoURL": "https://www.mangaupdates.com/series.html?id=69968",
        "description": "Ever wondered what a yandere Marisa would be like? you’ve been warned…\n",
        "year": "2009",
        "authors": [
            "Organic Compound"
        ],
        "tags": [
            "Comedy",
            "Doujinshi",
            "Female Yandere",
            "Straight"
        ],
        "id": "3ff430a8"
    },
    {
        "title": "Tomodachi Game",
        "infoURL": "https://www.mangaupdates.com/series.html?id=105379",
        "description": "From MangaHelpers:\n\nKatagiri Yuichi believes that friends are more important than money, but he also knows the hardships of not having enough funds. He works hard to save up in order to go on the high school trip, because he has promised his four best friends that they will all go together. However, after the class's money is all collected, it is stolen! Suspicion falls on two of Yuichi's friends, Sawaragi Shiho and Shibe Makoto.\n\nSoon afterward, the five of them are kidnapped, and wake up in a strange room with a character from a short-lived anime. Apparently, one of them has entered them into a \"friendship game\" in order to take care of their massive debt. But who was it, and why did they have such a debt? Could they have stolen the money from class to pay for entry into the game? Katagiri and his best friends will have to succeed in psychological games that will test or destroy their faith in one another.\n\n",
        "year": "2013",
        "authors": [
            "SATOU Yuuki",
            "YAMAGUCHI Mikoto"
        ],
        "tags": [
            "Drama",
            "Ecchi",
            "Mystery",
            "Psychological",
            "Shounen",
            "Female Yandere",
            "Straight"
        ],
        "id": "f653956f"
    },
    {
        "title": "Toumei Ningen no Tsukurikata",
        "infoURL": "https://www.mangaupdates.com/series.html?id=51536",
        "description": "Saitou Shinji is an Ordinary High-School Student living a peaceful life on a peaceful island… way too peaceful for his tastes. The only two things he enjoys on the island are the pranks he plays and the time spent with his Childhood Friend Kana, a cheerful girl who loves taking photos and understands Shinji better than anyone.\n\nHowever, when he runs away after an incident where he got angry and punched several classmates in the face, he receives a mysterious e-mail on his cellphone: \"If you answer this e-mail, you too can become an invisible man!\" He answers it while laughing it off… but the day after, everyone has inexplicably forgotten about the incident, and a mysterious white-haired girl appears before Shinji, calling herself an \"invisible woman.\" He soon realizes that answering this e-mail may take away from him the only thing he holds dear…\n\n",
        "year": "2010",
        "authors": [
            "MASUDA Eiji"
        ],
        "tags": [
            "Drama",
            "Mystery",
            "Romance",
            "School Life",
            "Shounen",
            "Supernatural",
            "Female Yandere",
            "Straight",
            "Incest"
        ],
        "id": "9d91d638"
    },
    {
        "title": "Tsubasa-chan, Kimi wa. Macchingu shita Onna wa Satsujinki",
        "infoURL": "https://www.mangaupdates.com/series.html?id=162605",
        "description": "A dull university student, Sousuke-kun’s only comfort lies in messaging Tsubasa-chan, a girl he met on a dating app. A cute and kind girl, talking to her only leads to good things for Sousuke. But who is Tsubasa-chan, really? During their messaging, by chance when sending a casual message, Sousuke opened the curtains to the play of his own hell. The fated girl, “Tsubasa-chan”, has set out to destroy his everything. So begins the unpredictable suspense story!\n(Source: MangaDex)\n",
        "year": "2019",
        "authors": [
            "Fukuoka Reona"
        ],
        "tags": [
            "Ecchi",
            "Horror",
            "Mystery",
            "Psychological",
            "Romance",
            "School Life",
            "Shounen",
            "Female Yandere",
            "Straight"
        ],
        "id": "72283f1e"
    },
    {
        "title": "Tsukimizuki Rikai no Tantei Satsujin",
        "infoURL": "https://www.mangaupdates.com/series.html?id=94202",
        "description": "From MangaHelpers:\n\nThere's a new wheel-chair bound student at school who has returned after an illness, and she immediately kisses Tsuzuki Ui, who she calls \"Rei-kun.\" He soon deduces that she is a daughter of a wealthy family, and a person he once beat at an internet murder mystery game. She is apparently fixated on him, since he was the only one who ever beat her, and she has now come to see him in person. Her plan is to have a real-life murder mystery game, and her current focus is on the supposed suicide of Tsuzuki's father. For some reason, she suspects his little sister Haruka... [tethysdust]\n\n",
        "year": "2012",
        "authors": [
            "AKATSUKI Senri",
            "SHIRAUME Nazuna"
        ],
        "tags": [
            "Drama",
            "Mystery",
            "Romance",
            "Shounen",
            "Tragedy",
            "Female Yandere",
            "Straight"
        ],
        "id": "08db44d8"
    },
    {
        "title": "Untitled",
        "infoURL": "https://e-hentai.org/g/940954/e0e4cc065f/",
        "description": "",
        "year": "2016",
        "authors": ["ray-kbys"],
        "tags": [
            "Full Color",
            "Female Yandere",
            "Straight"
        ],
        "id": "e0ebd123"
    },
    {
        "title": "Usotsuki Mi-kun to Kowareta Ma-chan Totteoki no Uso",
        "infoURL": "https://www.mangaupdates.com/series.html?id=56523",
        "description": "The setting is a rural city in which kidnapping and series of murders are happening simultaneously. Eight years ago, a boy and a girl were kidnapped and suffered through the hands of their perpetrator. The victims, the compulsive liar \"Mii-kun\" (the narrator), and \"Maa-chan\" (Misono Mayu) reunite and start living together, despite the fact that the recently reported missing children were ....\n",
        "year": "2010",
        "authors": [
            "IRUMA Hitoma",
            "SATOU Atsunori"
        ],
        "tags": [
            "Drama",
            "Mystery",
            "Psychological",
            "Romance",
            "Seinen",
            "Female Yandere",
            "Straight"
        ],
        "id": "3ffaa276"
    },
    {
        "title": "Uwakoi",
        "infoURL": "https://www.mangaupdates.com/series.html?id=69690",
        "description": "Yukiteru is living with his family friend Yuno after a fire burnt down his home as a child.  They live their life until a fellow classmate Rena who is jealous of their close friendship makes a surprise move.\n",
        "year": "2011",
        "authors": [
            "ITOSUGI Masahiro"
        ],
        "tags": [
            "Adult",
            "Drama",
            "Harem",
            "Romance",
            "School Life",
            "Seinen",
            "Tragedy",
            "Female Yandere",
            "Straight",
            "NSFW"
        ],
        "id": "7e8eb755"
    },
    {
        "title": "Watari-kun xx ga houkai sunzen",
        "infoURL": "https://www.mangaupdates.com/series.html?id=112785",
        "description": "Official English: INKR Comics, Azuki\n\nNaoto Watari has had his share of struggles: His parents died two years ago, and now he and his sister live at his aunt’s house. There, his desire to protect his sister earned him notoriety as “the guy with the sister complex,”—which never mattered to him, as his sister always came first. But when Satsuki, a childhood friend-turned-enemy, becomes his school mate, Naoto’s ordinary life is thrown into chaos … and Satsuki may just be the beginning.\n",
        "year": "2014",
        "authors": [
            "NARUMI Naru"
        ],
        "tags": [
            "Drama",
            "Ecchi",
            "Psychological",
            "Romance",
            "School Life",
            "Seinen",
            "Female Yandere",
            "Straight"
        ],
        "id": "dfc885a5"
    },
    {
        "title": "Watashi no Fushidara",
        "infoURL": "https://www.mangaupdates.com/series.html?id=135453",
        "description": "What if you could become young again? What will this young teacher do when this spirit offers her the ability to become a child again and live her love with her young pupil? What must she sacrifice to feel love for the very first time?\n",
        "year": "2016",
        "authors": [
            "OHMI Takeshi"
        ],
        "tags": [
            "Adult",
            "School Life",
            "Seinen",
            "Supernatural",
            "Tragedy",
            "Female Yandere",
            "Straight"
        ],
        "id": "64640a37"
    },
    {
        "title": "Welcome Home, Papa",
        "infoURL": "https://mangadex.org/title/3d6ccd3e-f430-4eed-b0bc-59f91803b83f/welcome-home-papa",
        "description": "A high school girl is trying to get obsessively close to her kind stepdad. Even going as far as watching him in bed with her mom.",
        "year": "2022",
        "authors": [
            "Semimaru"
        ],
        "tags": [
            "Psychological",
            "Romance",
            "Incest",
            "Web Comic",
            "Slice Of Life",
            "Female Yandere",
            "Straight"
        ],
        "id": "d3db28aa"
    },
    {
        "title": "Wholesome Yandere Strategy",
        "infoURL": "https://www.webtoons.com/en/challenge/wholesome-yandere-strategy/list?title_no=635301",
        "description": "At the sight of a someone who turns her monochrome world into vibrant color, the seeds of an obsessive, dark Yandere are planted within a cute, shy girl. How will she manage this darkness while chasing her romantic dream? And who says Yanderes can't be wholesome and cute?",
        "year": "2021",
        "authors": ["Waffflez"],
        "tags": [
            "Female Yandere",
            "Straight"
        ],
        "id": "70fadbcb"
    },
    {
        "title": "Witch Craft Works",
        "infoURL": "https://www.mangaupdates.com/series.html?id=52253",
        "description": "Takamiya Honoka, is a regular student whose only problem seems to be that he sits next to Kagari Ayaka, the school's #1 beauty. They have never crossed words before, and even a small interaction between them results in her fan club beating him. Yet when a falling part of the school's building is about to send him to the afterlife, it was her that came to his rescue. Except, she was dressed as a witch, using a princess carry to hold him in her arms as she floated on a broom. She continues to protect him using her fire magic until the attempt on his life ends. She tells him it is her mission to protect him, and that now she can finally protect him openly (she used different means to protect him \"undercover\").\n\nWhy was Takamiya attacked, who asked Kagari to protect him, why does she refer to him as \"my princess\" and what is her fan club going to do to him now that she will be close to him openly?\n\n",
        "year": "2010",
        "authors": [
            "MIZUNAGI Ryuu"
        ],
        "tags": [
            "Action",
            "Comedy",
            "Fantasy",
            "Romance",
            "School Life",
            "Seinen",
            "Supernatural",
            "Female Yandere",
            "Straight",
            "Harem"
        ],
        "id": "542ee239"
    },
    {
        "title": "Yandere Imouto ni Aisaresugite Kozukuri Kankin Seikatsu THE COMIC",
        "infoURL": "https://mangadex.org/title/cc0fb464-6c71-42f6-8e4a-422041f4af46/",
        "description": "Ayane is in love with Tomoya, Her Onii-chan. But, their childhood friend, Sayaka is trying to split them up. Ayane is not going to let that happen, No one can take Onii-chan away from her. Her plan? She wants Onii-chan only for herself, and she is willing to do everything to make that happen. She wants to have a family with Onii-chan, only the two of them. No one else matters in her little world, and she is going to take care of everyone who tries to interfere.\n\n[Artist's Twitter](https://twitter.com/gomzaburo)",
        "year": "2022",
        "authors": [
            "Tina Kurisu",
            "Gomzaburo"
        ],
        "tags": [
            "Psychological",
            "Romance",
            "Incest",
            "Harem",
            "School Life",
            "Adaptation",
            "Female Yandere",
            "Straight"
        ],
        "id": "8f9e8cb9"
    },
    {
        "title": "Yandere-kei Otomege no Sekai ni Tensei Shite Shimatta You desu",
        "infoURL": "https://www.mangaupdates.com/series/7wqar3n/yandere-kei-otomege-no-sekai-ni-tensei-shite-shimatta-you-desu",
        "description": "In a crazy turn of events, the Lycoris family has been targeted and reborn into the world of a yandere otome game. They can try to use their knowledge of their past lives to go straight to the ending of the game, but they have to watch out for the \"bad ending\"... Drama ensues and relationships form... maybe even a little too fast. Enter a world full of mystery and romance that's sure to take you on a wild ride!\n\nOriginal Web Manga (Full Color)\n\nOfficial Translations:\nEnglish, French (Piccoma, Pocket Comics), Thai\n",
        "year": "2018",
        "authors": [
            "HANAKI Momiji",
            "Setsuri"
        ],
        "tags": [
            "Comedy",
            "Drama",
            "Fantasy",
            "Romance",
            "Shoujo",
            "Male Yandere",
            "Straight",
            "Harem"
        ],
        "id": "40bd2cf5"
    },
    {
        "title": "Yandere Giga Girlfriend",
        "infoURL": "https://hitomi.la/manga/yandere-giga-girlfriend-english-1854302.html",
        "description": "",
        "year": "2021",
        "authors": null,
        "tags": [
            "Female Yandere",
            "Straight"
        ],
        "id": "73e15776"
    },
    {
        "title": "Yandere Miko-chan",
        "infoURL": "https://mangadex.org/title/997daea0-da85-401f-aefb-dc1f0643118c/",
        "description": "",
        "year": "2020",
        "authors": [
            "Anonymous"
        ],
        "tags": [
            "Long Strip",
            "Web Comic",
            "Doujinshi",
            "Female Yandere",
            "Straight"
        ],
        "id": "5a3c5c6a"
    },
    {
        "title": "Hatsukoi Lovers",
        "infoURL": "https://www.mangaupdates.com/series.html?id=83339",
        "description": "Mamori Kusunoki's childhood friend Wakaba Kisaki has been dressing and acting as a girl for years, stemming from a promise to get married when they were kids.\n",
        "year": "2012",
        "authors": [
            "ARARAGI Ayune"
        ],
        "tags": [
            "Comedy",
            "Gender Bender",
            "Romance",
            "Shounen Ai",
            "Male Yandere",
            "Gay"
        ],
        "id": "4b29046a"
    },
    {
        "title": "Onii-chan Complex",
        "infoURL": "https://www.mangaupdates.com/series.html?id=91045",
        "description": "This is the second entry in a series of yandere trap one-shots Ayune Araragi is doing for Waai Mahalo. These one-shots don't share any common characters, they are only related by theme.\n\nHaruki's younger brother Natsuki dresses like a girl and always clings to him. This is starting to cause problems after Haruki gets into high school, so he tries to think of a way to work things out with Natsuki.\n",
        "year": "2012",
        "authors": [
            "ARARAGI Ayune"
        ],
        "tags": [
            "Gender Bender",
            "Seinen",
            "Male Yandere",
            "Gay",
            "Incest"
        ],
        "id": "e22e55ba"
    },
    {
        "title": "Houkago, 2-C no Kyoushitsu de.",
        "infoURL": "https://www.mangaupdates.com/series.html?id=98540",
        "description": "Yuuto Sasaki is a trap who forces his homeroom teacher Sasaki Tsukimori to spend some quality time after school, which usually entails Sasaki playing a domineering role over Tsukimori.\n\nNote:  Original language image is not available.\n",
        "year": "2013",
        "authors": [
            "ARARAGI Ayune"
        ],
        "tags": [
            "Gender Bender",
            "Mature",
            "Psychological",
            "Romance",
            "Shounen Ai",
            "Male Yandere",
            "Gay"
        ],
        "id": "b7152025"
    },
    {
        "title": "Present koukan wa kiken na kaori...!?",
        "infoURL": "https://www.mangaupdates.com/series.html?id=104238",
        "description": "Wakaba, Natsuki and Sasaki from Hatsukoi Lovers, Onii-chan Complex, and Houkago, 2-C no Kyoushitsu de. come together and exchange presents shortly after Christmas and talk about who they love.\n",
        "year": "2013",
        "authors": [
            "ARARAGI Ayune"
        ],
        "tags": [
            "Comedy",
            "Gender Bender",
            "Shounen Ai",
            "Male Yandere",
            "Gay",
            "Incest"
        ],
        "id": "de852944"
    },
    {
        "title": "Yandere vs. Yandere",
        "infoURL": "https://www.mangaupdates.com/series.html?id=154064",
        "description": "Two yandere flirting with each other.\n\nOriginal Webcomic\n",
        "year": "2019",
        "authors": [
            "Tsukamoto Yumehiro"
        ],
        "tags": [
            "Comedy",
            "Psychological",
            "Romance",
            "School Life",
            "Slice of Life",
            "Male Yandere",
            "Female Yandere",
            "Straight"
        ],
        "id": "89603c31"
    },
    {
        "title": "Yandere's Confession",
        "infoURL": "https://www.mangaupdates.com/series.html?id=186916",
        "description": "Original Web Comic: Twitter, Pixiv\n",
        "year": "2019",
        "authors": [
            "Suama (すあま)"
        ],
        "tags": [
            "Drama",
            "Slice of Life",
            "Tragedy",
            "Female Yandere",
            "Straight"
        ],
        "id": "69e7f528"
    },
    {
        "title": "Youko x Boku SS",
        "infoURL": "https://www.mangaupdates.com/series.html?id=42561",
        "description": "From Yen Press:\nThe elite and beautiful Ririchiyo Shirakiin has a bad habit—she can’t help but lash out at people with her vicious tongue, all while hiding behind a mask of haughty cool. This attitude has a lot to do with people minding her business because of the Shirakiin family name, but it troubles Ririchiyo to no end. \nIn search of independence and solitude, she moves to the Maison de Ayakashi, an apartment building full of wealthy tenants and with its own Secret Service. Ririchiyo is eager to be alone, but upon her arrival, she is greeted by Soushi, an SS agent arranged for her by her parents. Ririchiyo tries to turn Soushi away, but Soushi’s dogged devotion to his new mistress will not be deterred. The threat against the residents of the Maison de Ayakashi are not to be taken lightly, after all. \nAnd despite his puppy-like demeanor, Soushi is not to be trifled with either.\n\n",
        "year": "2009",
        "authors": [
            "FUJIWARA Cocoa"
        ],
        "tags": [
            "Comedy",
            "Drama",
            "Fantasy",
            "Romance",
            "School Life",
            "Shounen",
            "Slice of Life",
            "Supernatural",
            "Tragedy",
            "Male Yandere",
            "Straight"
        ],
        "id": "8db98b74"
    },
    {
        "title": "Zaako Zako Zako Sensei",
        "infoURL": "https://www.mangaupdates.com/series.html?id=186442",
        "description": "Souichi Kirisaki, who teaches at a private middle school, has a problem. Three of his students, Senka Yutugami, Yuki Kitsuregawa, and Momoka Watarase, make fun of him. Souichi wants to be friends with them, but they look down on him and tease him every day. Soichi is troubled, but the truth is that all three of them love Souichi, they just can't be honest with him, plus Momoka is a stalker... A sassy and cute romcom between a teacher and three middle school students!\n",
        "year": "2021",
        "authors": [
            "Zeroyon"
        ],
        "tags": [
            "Comedy",
            "Harem",
            "Romance",
            "School Life",
            "Seinen",
            "Female Yandere",
            "Straight"
        ],
        "id": "3a37f1dd"
    }
]